                              
                                ----clock----
* 2016
#+BEGIN: clocktable :maxlevel 3 :scope subtree
#+CAPTION: Clock summary at [2016-10-29 sáb 23:04]
| Headline                    | Time   |      |      |
|-----------------------------+--------+------+------|
| *Total time*                | *3:29* |      |      |
|-----------------------------+--------+------+------|
| 2016                        | 3:29   |      |      |
| \emsp Octubre               |        | 3:29 |      |
| \emsp\emsp [2016-10-22 sáb] |        |      | 0:31 |
| \emsp\emsp [2016-10-23 dom] |        |      | 0:10 |
| \emsp\emsp [2016-10-24 lun] |        |      | 0:28 |
| \emsp\emsp [2016-10-25 mar] |        |      | 0:29 |
| \emsp\emsp [2016-10-27 jue] |        |      | 0:11 |
| \emsp\emsp [2016-10-28 vie] |        |      | 0:23 |
| \emsp\emsp [2016-10-29 sáb] |        |      | 1:17 |
#+END:

** Junio
*** [2016-06-21 mar]
[Originalmente escrita en zoho doc en la oficina]
hoy aparte de cagarme mal de frio como lo vengo haciendo estos ultimos
quince dias y madrugar como un pelotudo, me replanteo por primera vez
la viabilidad del esquema o dibujo aca en este local.tengo que decir
que el suceso de la CD del 14/6 aunque totalmente esperado el
desenlace en algun  momento, y quizas aunque se pueda pensar que lo
provoque al quiebre por hartazgo o lo precipite como paso con 194 o
147 en su momento, y hasta quizas con los otros dos casos, ibamos a
entrar en una etapa peor de problematica de mala venta y asi por lo
menos se aclaran los tantos. Sigo diciendo el suceso cd viene a
ensuciar un poco los animos sobre el local que ya estaban caidos por
el frio y el hambre.ya no era la misma sensacion que las primeras dos
semanas.No lo puede haber con un frio de cagarse.Y a la vez la ventaja
es que el esquema armado hasta ahora es de muy baja incidencia (tres
motos de diferente horarios,mas ramiro dia por medio a la mañana, y
tres a la tarde dos veces por semana). O sea un esquema por demas
parco.y la captacion de venta por oficina que es la asignatura
pendiente y la obligacion de este sistema esta pendiente.
Parte obviamente por el accidente del auto de venta y las
complicaciones de suplantar el auto, y ahora con el 504 por un lado
que puede frenar la venta o las expectativas y por otro el impasse
de vivir en el barrio en incomodidad para poner un grupo a trabajar
hacen que se demore esa idea. Aparte que uno piensa que la situacion
y el clima serian adversos.Pero seamos realistas, con estos tres
cobradores mas o menos cubrimos las zonas vacantes con mas control
y a la larga eso sera diferente y nada impide poner otro mas cuando
uno quiera pq ya no se cae en la prision de tener que esperar que el
otro haga o devuelva la zona. Y tambien perdimos el miedo de no saber
donde vender por la causa de no tener cobrador, ahora se vende donde
se puede y se cobra ahi pq no se reparte territorialmente. O sea que
el sistema sirve aunque este en un bajon momentaneo tanto laboral
como personal.

Y ello se ve agravado (lo del bajon) por las características del local
(sótano y frio) y la inactividad (falta de promotores) lo que produce
un sobrante de tiempo que ni siquiera se puede aprovechar para la sana
reflexion y/o algún otro trabajo util para la empresa pq uno esta en
un subibaja emocional y una perdida de tiempo y en tratar de encontrar
las rutinas.

Pero seamos realistas al dia de hoy no puedo plantearme una captación
a partir de mañana que no dudo que sera exitosa en el contexto de no
tener auto. Pero ya una vez que le den el auto (que seria la semana
que viene) arrancaríamos julio con el esquema nuevo.

Sistema nuevo:
Pack 2 cortinas 6 cuotas de 240 o 260. (explore la posibilidad de
hacer pack con una cortina y un toallon fantasia pero es debil pq
no hay provision continua).
Exigir un pack por dia y tratar de bajar el valor unitario de los
packs extra por comision.
El tema es mantenerse con un grupo de bajo perfil, o sea gente tranqui
que produzca y gane y quiera quedar no con amontonamientos de gente
que no sirven.
**** SENTIMIENTOS EN GENERAL SOBRE EL TRABAJO
siento en general y en particular que es un trabajo de mierda.
me siento en un pozo. en un sotano literal.
cagado de frio y de hambre todo el dia.
forzando las posturas porque encima este sillon es incomodo y
me quedo sentado mas de la cuenta.
pero todo coincide con ese estereotipo de las peliculas de ese lugar
horrible para trabajar donde uno esta enterrado todo el dia y no
puede salir de alli.

A eso hay que agregarle el sindrome de la espera que desespera,
o sea el tener que esperar y sufrir por esa espera de los cobradores
que tienen que volver.
Y esa preocupacion que la tengo todo el dia no solo cuando espero el
regreso que algo pase con las motos. (lo cual no es racional pq
siempre teniamos un grupo de cobradores en moto pero no lo veiamos
en forma tan diaria y continua como es aca la cosa).

Y a esto le tenemos que sumar el problema laboral.
Dara para vivir en coral??
*** [2016-06-22 mié]
[Originalmente escrita en zoho doc en la oficina]
Ayer vuelvo tarde luego de las consideraciones anteriores. Y lo clave
es que paso por la verduleria al lado del chino. un sucuchito atendido
por un bolivianito muy piola y con mercaderia bastante buena, buenos
precios y bastante honesto. Compre rucula, granadas, rabanitos,
manzana y limones.
Llegue a casa y comi una granada, luego tipo 8 me hice una ensalada de
rucula con rabanitos y ajo, no muy grande y comi eso solo mientras
veia series, tranquilo. Y sin apuro. Y luego mas tarde me hice la
sopita que la tome sola, sin celu al lado, tranquilo tambien, y
continue viendo serie, y mi panza estaba contentisima. Notaba la
revolucion de los verdes y el ajo adentro pero bien.
Duermo medianamente bien -no espectacularmente- y en una noche que
me parecio mas bien corta me acicateaba el dolor de cabeza que lo
atribui a limpieza estomacal, vi la hora y era las 6.26 decidi
levantarme tomar migral y comer el gran muesli (6cd avena manzana
y 12 almendras) en el trono mientras ponia al dia el tema. Con
total paz y tranquilidad y confort. (unico por el calorcito de ese
baño).  Y luego me voy rapido con una salida un poco jodida pq estaba
oscuro todavia y llego casi con lo justo, pq entro a las 8.08 y ya
quedaban pocos lugares.
Hasta este punto resaltan tres puntos en el relato
la sensacion de abrigo y calidez y ataraxia y home-sweet-home que da
el volver a casa comodo cuando la temperatura interior alcanza
cierto nivel y teniendo el futon. (Esto para considerar el tema
coral u otro dpto).
el tema alimentario como cambia enormemente. Los alimentos puros
naturales te cambian por dentro y te arreglan por dentro y la
regularizacion de transito intestinal tambien pq eso tiene algo que ver.
el tema horario para salir a trabajar es jodido pq aun levantandome a
las 6.30 y repitiendo lo de hoy (cosa dificil de cumplir si no mediaba
el migral de hoy), tendria que salir un poco antes, tipo 7.30 para
estar llegando 7.50 a la cochera. Y eso plantea una salida casi de
noche, a las 7.30 es igual de riesgoso que volver de noche.
Hoy por hoy siento esto
una sensacion sobre el centro que es algo fantasmal, no solo algo
sucio, gris, roto, viejo, sino que la gente que camina -yo incluido-
somos zombies.
ni hablar de la galeria mitre arriba o subsuelo o mi local (safa el
subsuelo cuando hay movimiento de los locales 5 y 6 con un aporte de
juventud y gente sino seria tetrico y patetico que no hubiese nadie
abajo). Arriba la veo igual que el resto del centro o sea al trasluz
del  cristal zombie y los viejos de los relojes no se si estan vivos o
son momias. Ni al baño bajan.
incluso si bien es cierto que el edificio coral lo veo como algo
distinto tanto en la entrada y arriba (sin ser tan expelente como si 
fuera algo realmente 0km de nueva cordoba aunque este punto esta por
analizarse en los momentos mas bajos), lo salva la vista y la
luminosidad
de las ventanas. Por el momento no me convence 100% (como no lo hace
ningun otro edificio y no es por el tema de la complejidad de alquilar
que es igual en todos lados o de mudanza sino por el estado en que me
encuentro ahora animicamente).
el problema que veo en el coral en particular es que no hay forma de
calefaccionarlo sin caer en excesivo gasto (si es que se pudiera por
medio del aire frio/calor). ya que el equipo es chico para ese dpto.
Y uno se cagaria de frio y no hay gas. Y encima no hay cortinas. (O
sea el problema puede ser un tema tipo bolivar 553 o sea efecto invernadero).
ante los problemas que arrecian (por el cambio que hicimos y que a
algunos no les gusto) y por la dinamica propia del trabajo en el
centro (gran aburrimiento, frio, sotanidad, sindrome de espera
continua, preocupacion continua por causa de la espera) no tengo gran
entusiasmo por venirme al centro. Quizas luego de tener todo arreglado
y con suerte de que el sitio sea correcto (ruidos y temperatura y
demas) podria tener solaz con el tema alimentario y quizas poder salir
a algun evento cultural de vez en cuando. Y quizas s
*** [2016-06-27 lun]
[Originalmente escrita en zoho doc en la oficina]
estuve pensando un poco este fin de semana en comprar una garantia al
menos de recibo de sueldo, pero luego de estudiarlo un poco en google
concluyo que no va pq es muy riesgoso. O sea que no me queda otra que
intentar ofrecer el local y meses adelantados.
Ya tendria que estar buscando con todo impetu un dpto donde meterme pq
si algo que he demostrado con estos dias es que quedarme fijo en
marques es malisimo. (insalubre y totalmente incomodo) quizas podria
soportar un tiempo, con la liberacion de la casa lo cual seria algo
positivo
** Setiembre
*** [2016-09-07 mié]
    Pero si recupero la idea de hace solo un mes de hacer un plan de
    estudios creo qu con python avance un monton. Queda mucho por
    aprender todavia.
*** [2016-09-08 jue]
    Hoy establecimos que los patas deben cumplir la norma Raul o sea
    entrar a las 9.30hs y cortar a las 14hs y volver a las 15hs.

    Subi a github pero tengo dudas pq expongo publicamente el codigo
    solo por no usar bien un pendrive. Pero la verdad es que reniego
    mucho con tener sincronizacion en las tres maquinas y con la de
    Fede cuatro. Lo cual es bastante positivo, he perdido mucho codigo
    hasta el dia de hoy y no veo mal esa funcionalidad. Quizas
    cambiando a un nombre mas criptico.

    La programacion por ticket que implemente desde ayer es muy buena
    pq me focaliza a la productividad y me quita la presion de no
    avanzar. Y a la vez me deja tranquilo que no pierdo u olvido
    nada. Y el cuaderno de reflexion (el marron grande) permite
    analizar donde queremos ir, que queremos hacer.
    Igual con relacion a cada desarrollo o modulo o metodo o funcion
    definirla conceptualmente para que sea mas facil de entender.
*** [2016-09-09 vie]
    Hoy un poco trabado el tema con el tabGrupo. Pq cai en un pequeño
    bug de copiar el mismo nombre asignado a data en los pivot y me
    hizo pensar que los nombres de b1/t etc estaban repetidos, pero
    no.
    Igual hice un metodo para asignar tipo a las columnas [-x] o sea
    con un numero negativo seteo todas las columnas menos esa (lo cual
    es util en los pivot mas que todo) Luego el metodo colreset() para
    redefinir las columnas sin tener que determinar el tipo de
    nuevo. Pienso que este finde me termino el recibeador y el tab
    grupos o sea la info.
    Y hay que comenzar el fechador.
    MB mercurial con bitbucket incluido pq no solo organizamos sino
    que tenemos todo disponible.
*** [2016-09-14 mié]
    Falta cronicar que alla el finde sab/dom me sumergi en fossil. Y
    los emboles fueron pq en la netbook no tenia un webbrowser por
    defecto (al haber borrado el palemoon que viene por defecto) y eso
    hacia que cuando ponia fossil ui colapsara la maquina buscando el
    webbrowser por defecto y tenia que resetear (lo hice como diez
    veces)
    Pero fossil me resulto muy funcional y rapido. Funciona localmente
    se puede incluso backupear como un archivo standalone.
    El manejo en la web se hace muy rapido a pesar de que el proveedor
    no es muy que digamos y en cualquier momento desaparece.
    Me gusta lo claro del timeline, los ticket y el diff. Lo he usado
    en las tres maquinas y ha resultado muy eficiente.
    Hoy conoci gitlab que parece ser el google de los git. Una
    programacion de primer nivel gratis de por vida. Con miles de
    proyectos. Nose por ahora sigo y veo. El problema es que no parece
    ser tan agil y rapido. 
    Hoy no fue muy fertil pero lun y mar he pulido lo hecho y no hice
    nada nuevo. Por eso creo que sera mas facil agregar desde aca.
    El curso MB creo que se logran conocimientos que no tenia aun en
    Python que lo manejo mas, y el de html esta interesante
    tambien. Luego vere el que se puede hacer.
    Proximos tickets recibeador y depurar los geolocs.
*** [2016-09-15 jue]
    hoy avance en el curso php primera parte.
    Renegue bastante con poco avance en el programa pq me distraje con
    emacs. Si aunque parezca risueño. Al final obvio termino con
    atom, pero perdi como 2 horas puras hoy en eso. Y asi se va el
    tiempo. Ayer con git hoy con emacs la otra semana con vim. Todo
    instrumental pero nada de avance. Y algunos avances son muy
    escasos.
*** [2016-09-20 mar]
    el viernes pasado programe y avance. El sabado fue emacs puro en
    marques, y el domingo descubri spacemacs y lo saque en el dia y a
    la noche entre en produccion.
    Ayer produje bastante y hoy tambien. Todo en emacs, pero en modo
    vim. Muy rapido. Al lado de gente que lleva años en eso.
    Muy importante: hoy a la tarde hice en el entretiempo de
    programacion una serie basica completa 10/12/10 dos veces y me
    encinte la pared para pintar. Mañana traigo la bandeja y pinto.
    Esa mezcla con la programacion es optima.
*** [2016-09-21 mié] 
    Desde ayer implemento un tip que se me ocurrio y es hacer una serie de ejercicios
    simples (los mismos tres que conozco desde hace casi 30 años) por cada hora o periodo
    de maquina, como pago. Mas 5 sentadillas. Y el resultado ha sido fenomenal, pq me
    saca la contractura y un poco el dolor de espalda (aunque hoy estuve doblado cuando
    fui a trabajar) sino que tiene efectos espectaculares en el animo. Tanto es asi que 
    ayer me puse a encintar toda la pared y hoy la pinte.
    
    Lucho contra la idea de ir y volver respecto a la herramienta. Hoy pensaba volver a
    vim, pq lo veo rapido y expedito, (siendo que tengo aca evil que muchos dicen que es
    mas lindo que vim). Y siendo que descubri org-mode que recien estoy aprendiendo y es
    extraordinario, para irlo conociendo de a poco.
    
    No quiero perder el ritmo de la programacion. Siendo que voy viendo resultados. 

*** [2016-09-22 jue]
    Hoy termine de pintar la pared del living y colgue los cuadros
    cambio muchisimo y no fue gran tarea, sino que fue agradable y
    permite cambiar un poco de actividad

*** [2016-09-25 dom]
**** Ejercicio-movimiento
     Esta ultima semana al menos comence a hacer ejercicio y ahora con
     tomatinho pienso que se facilitara muchisimo comenzar a moverse
     durante la jornada y evitar el anquilosamiento.
     Asimismo pasar de 20 cuadras basicas a 30 o 40 no lo veo dificil ni
     imposible.
**** Implementar cuanto antes el 3x12
**** Alimentos
     Urgente debo volver a una alimentacion mas sana. Hoy comi
     pollo/gaseosa/helado o sea el trio maldito que alguna vez habia
     superado. Mucha manteca, mucho pan. Un desastre. Esta ultima semana no
     hice el muesli ni un dia.

**** Acomodo del dpto
     La semana pasada di un paso gigante que fue la pintada de la pared.
     Debo seguir con ese sistema en lo posible.
*** [2016-09-27 mar]
    Hoy dia defini hacer dos cositas que estaba evitando de una y
    punto.
    Dia que sufri malestar pq surgio un malestar en el ojo izquierdo.
    (Fuerte dolor punzante en el ojo, sin latidos, pero que no tenia
    ninguna relacion con la migraña u otro dolor de cabeza, me calme
    yendome temprano a acostar y haciendo palming en el ojo. Al otro
    dia mejore y no me volvio).
    Orden de ideas pq se traslapan y se rompen:
    1. git -->gitlab
    2. mega
    3. orgmode
    4. emacs
    Seguir programando nomas
*** [2016-09-28 mié]
**** Entre ayer y hoy tome el toro por las astas
     en un par de cosas que estaba demorando como ser comprar la camisa en
     rochas, ir al peluquero, y hoy arreglar los cueritos de las
     canillas. Y los tres asuntos los resolvi expeditamente, o sea creo que
     no hay porque demorar las cosas.

*** [2016-09-29 jue]
    Hoy es un milestone en nuestras vidas. Hoy recibio su diploma de
    Contadora la Rominita. Ha pasado un largo trecho desde aquella noche
    de julio del 91 cuando solo en la oficina escribi un post,
    lamentablemente perdido en DOS-WordStart alusivo al nacimiento de la
    Romi y 25 años despues estoy escribiendo esto en una herramienta que
    no difiere mucho de aquella en cierta forma, y quizas tambien
    destinado a perderse.
    Me alegra que ella haga algo de su vida y haga las cosas bien.
    Fue un dia feliz, aunque no tenemos los musculos de la felicidad muy
    entrenados en la familia, al menos en la modalidad expresividad.

**** Referencia al metodo usado en los ultimos tres dias
     Constructo: Actua como un tipo normal.
     Con relacion al evento (que causo mucha preocupacion anticipatoria e
     innecesaria casi al nivel de la opercion de mi vieja), se planteaban
     un par de todo's necesarios y urgentes que eran los que me causaban
     problema. Necesitaba comprarme una camisa e ir al peluquero. Aunque
     ambos temas son ridiculamente banales, representaban un problema en el
     sentido de que son ambas situaciones que me incomodan, ya sea en el
     sentido de ir y hacerlas y en el sentido de pensar que voy a salir
     defraudado por dichas acciones. Y el constructo usado, me movilizo y
     el martes volvi temprano de la oficina, me bañe rapidamente, me puse
     el saco y fui a comprar la camisa en un proceso directo y normal.
     Luego ayer fui al peluquero, por ahi el problema no era tanto ir a las
     dos opciones, sino el patetico miedo a que no fuera satisfactorio el
     resultado. Y con una ligerisima duda, fui y el resultado me parece
     mejor que la ausencia de resultado, o el demorarse como lo hacia antes
     con el resultado de andar desprolijo  e impresentable.
     Quedaba procesar el evento, y alli el constructo fue dividirlo en dos
     partes, por una parte la ceremonia, y luego el ir al lugar, y eso
     quito un poco de presion, una vez en el lugar el resultado fue
     bastante positivo a pesar de la situacion, (almorzar con niños en un
     sitio asi, y el que Fede pobre estuviera tan dolorido y molesto).
     Creo que como me pasa en la mayoria de las situaciones, alli no fue
     problema de plata, ya estaba jugado, sino el pensar que podia faltarme
     con lo que habia llevado.
     Pero pienso que la experiencia es positiva y tiene un efecto
     liberador.
     Y alienta a en el futuro encarar las cosas con mas asertividad.

*** [2016-09-30 vie]
    Dia

** Octubre
*** [2016-10-10 lun]
Ayer experimente junto con la migraña otra recaida del estado animico,
lo que se manifesto principalmente durante la crisis, en la mañana de
hoy hasta volver de mi vieja y antes de la crisis migrañosa desde el
malestar animico con/contra las chicas desde la pataleta de la Cami,
pasando por la crisis de expansion de herramientas y crisis de
vacuidad o de dificultad para aprehender todo lo que leo, que en el
mismo dia de ayer procese entre dolores entre los dos cafes con la
determinacion de centrarme unicamente en dos cosas (python y orgmode).

Tambien influyen certeramente los sonidos, ya sea los sonidos lejanos
de barrio (que no son los mismos felizmente en el centro) como la
musica, los vecinos escuchando cuarteto, o folklore o simplemente el
ruido de los autos en la circunvalacion.
Todo esto te golpea pq uno esta en un estado de no-felicidad o
no-placer o insensibilidad. Aparte de la circunstancia de sentirse
mal, pq esta uno atrapado en la migraña y no tiene solucion, o no ve
la solucion o no ve que el medicamento te haga efecto, y eso te
distrae de lo que estas haciendo o te hace pensar que no podes o no
podras disfrutar de nada.
Tambien te afecta no tener objetivos o creer no tenerlos. En realidad
cuando estaba dentro de la crisis
[2016-10-08 sáb 15.00]--[2016-10-10 lun 13.00] crei no tener objetivos
o crei que mi vida no tenia sentido. Ahora lo veo distinto asi sea que
los objetivos sean insanos, -que podrian no serlos con algunos habitos
positivos intercalados- o sean atipicos. En realidad tengo un gran
objetivo, que es doble y ha veces hace que me pierda:
- Profesionalizar grandemente el negocio mediante un CMR y un conjunto
  de reglas de negocio, y un gran tablero de control
- Aprender lo que mas pueda de programacion y todos los temas
  relacionados.
Ambos objetivos que estan relacionados son importantes y son utiles.
Pq redundan en menos horas de trabajo, en mas desarrollo mental y en
posibles aplicaciones futuras que ahora desconocemos.

En el medio obviamente uno se pierde a veces.
En el medio puede que uno pierda el foco, o bien se canse y se
distraiga en forma desmedida y no sepa bien para donde ir.
O bien puede ser que los sufrimientos que te da el padecimiento de una
enfermedad (cosa de la cual nadie esta exento y menos yo, no hace
falta que de ejemplos) te hagan desepcionar o desilusionar siendo que
no tendria que ser asi.

Los avances son muchos y no deberian ser desdeñados.

*** [2016-10-11 mar]
Hoy amaneci pensando un par de cosas respecto a como integrar org-mode
con mis problemas actuales.

**** Usar el diario para filosofar e ir acumulando en un solo lado
Me gusto la experiencia de ayer en el sentido de hacer un autoanalisis
-que resulta muy efectivo y barato jeje- como lo hice la ultima vez en
el cuaderno.
Lo unico que org-mode puede precisamente ayudarme a esto a org --
mode. o sea a organizarme mejor. Pq via git lo tengo en todos lados y
via org si o si fechas, y luego tenes la posibilidad de tagear y de
buscar de manera mas eficiente.
Incluso el repositorio de gitlab privado p.e. mantenido en forma
separada al codigo es un buen lugar para acumular los escritos.
**** El sentido de filosofar o la necesidad en este momento
me refiero a filosofar quiza mas en el sentido de Eric Fromm o sea el
de un personal autoanalisis para reponerse y reacomodarse.
Lo sufrido este fin de semana en el perido descripto ayer te da un
poco de miedo, respecto a la debilidad de uno mismo para ser ecuanime
y quizas mantener la cordura o las relaciones intactas. Y como ese
bajon te viene y uno no tiene herramientas para combatirlo.
Hoy (post-hecho) me alegro de haber ido a mi vieja, en vez de quedarme
a lamentarme o ponerme mas oscuro y arruinarle el dia a ih.
Tambien pienso que ponerse a hacer una actividad fisica fuerte en ese
momento de distimia puede ayudar.
**** En si el cambio empezo cuando saque el auto
alli me empezaron los pequeños planes de hacer algo con el auto y no
dejarlo arrumbado ahi, y eso en cierta forma me cambio la mentalidad.
Hay un monton de lados donde uno podria ir a pasar el rato y esa
costumbre de permanecer encerrados y lugubres dentro de esa pieza no
es buena. Pero esto lo veo ahora que estoy aca en la oficina. Hay que
estar alla. 
**** Como enfrentar los miedos
ayer las chicas se fueron a cpaz y obviamente me asaltaron un monton
de miedos y aprensiones, y las espante de forma un poco extrema
diciendome a mi mismo o a los miedos, bueno ya, que pase lo que tenga
que pasar y a la mierda que se vaya todo a la mierda. O sea recuerdo
que me dije a la bosta si las matan a las dos. se va todo a la mierda,
... pero no voy a tener miedo, o sea no voy a permitir que sufra por
anticipado por cosas que quizas no pasen nunca. Y despues recorde que
yo muchas veces habia ido cuando joven y pq ellas no pueden hacer lo
mismo. Y creo que esa es la forma general de enfrentar los miedos sino
vivis una vida patetica de aprensiones de fantasmas que te acechan y
no te dejan vivir en paz.
**** Respecto a org-mode y su aprendizaje:
Pense que ya que tengo un conocimiento basico mas o menos general que
me permite ir produciendo en el, podria comenzar tranqui y en forma
organica y sistematica ir aprendiendo con vias al mastering.
P.e. comenzando un tema, como puede ser las tablas. Y aprender todo
sobre eso y luego ir avanzando capitulo por capitulo de acuerdo al
interes que tenga.

*** [2016-10-12 mié]
**** Crisis de trabajo en el hogar
    creo que el horario reducido me hace mal. Porque me da la
    sensacion de que estoy en falta y no esta bien lo que hago.
    Hoy por ejemplo llegue aca a las 10.30hs tome una segunda leche pq
    la primera fue muy deficiente y no me fui directo a programar ni
    al tema computacion. Sino que me puse a buscar los doc a devolver
    y de paso libere un estante para los docs y puse alli los tocos de
    docs ordenados de a cien (solo faltan 17 que debe ser un toquito
    mesclado con los recibos). Los recibos los apile sin orden de
    fecha, en caso de necesitar tendre que sacar todo. Creo que tendre
    lugar alli para un año. (De todos modos creo que los recibos
    tendria que destruirlos y a la maquina de aca encriptarla).
    [Ampliar tema seguridad]
    Luego conte y revise 4 fajos, cosa que es una tarea de siempre y
    lo mismo se hace hace aca como prolongacion  de la oficina.
    Hasta alli se podria pensar, en una jornada de 9 a 12hs en oficina
    "llenada" con computacion o una jornada adosada terminada aca con
    dos tareas de oficina que son altamente necesarias.
**** Crisis de comida
    Luego me fui a comprar algo de verduras.
    Alli otro tema, es que vengo mal con la comida. Al perder los
    habitos basicos de licuado y muesli quedo bastante
    maltrecho. Porque pierdo energia y nutrientes que tenia con
    seguridad.
    Casi que estoy entrando en una crisis de compras de alimentos, pq
    dos por tres el super me resulta tedioso al tener que hacer cola
    en cualquier horario para traer dos o tres cosas locas. Y al no
    querer destinar ningun horario para eso. Hoy fui a esa
    verduleriita de la vuelta y es muy poco lo que tienen y al haber
    caido en un pozo alimentario no me resulta facil determinar que es
    lo que quiero comprar o comer.
    Luego voy camino a la subalimentacion y al abuso del pan y a la
    falta de fuerza por falta de alimento y a los efectos secundarios
    por falta de nutrientes que se manifiestan sicologicamente y a lo
    peor de todo a la dependencia de ir el fin de semana alla pq
    necesito comer bien.
**** Levantar de a poco los habitos
     podria recuperar de uno a uno los habitos y llevar la cuenta de
     como voy en ellos en un org ad-hoc.
     P.e. el primero que hare ya mismo es el licuado.
**** Analizar (con analista) los problemas (supuestos)
     obvio que todo nace de una BTF gigante. P.e. hoy me amargue con
     el dpto que en general me gusta y al que estoy acomodando para
     que me guste mas, pq no tiene balcon donde desagotar el aire ac.
     Y bueno solucion 1, poner la manguera adentro y soportarla asi,
     de todos modos estoy mejor que los ochenta monos aca adentro que
     no tienen aire por lo visto.
     solucion 2, seguir el caminito del vecino de abajo o sea poner
     una prolongacion de 2 metros y hacerlo caer justo en el mismo
     punto del vecino de abajo, de modo tal que seamos dos
     supuestamente.
     solucion 3 si me voy a poner belico, es reclamar que la falta es
     parangonable con las mascotas que abundan en el edificio.
     solucion 4 (utopica) prolongar mas y hacerlo salir en la
     cocina...

     Una vez analizado un problema pierde su dimension y pasa a ser
     una molestia mas.
     La sensacion que te invade es que si tenes un problemita se te
     viene la maroma o toda una maroma haciendote invivible el sistema
     en general. O sea una generalizacion e intensificacion difusa de
     los problemas. O sea me siento mal pq en general este dpto se
     transformara en una mierda para vivir (o sea asi pensaria frente
     a un problema especifico que requiere TF y no tanta BTF)
**** Sintoma reaparecido dolor ojo izquierdo
     Comenzo levemente a las 13hs y me recoste despues de almorzar sin
     leer pantallas y tratando de hacerme palming, pero las untaditas
     vienen solas. Me tome la presion dos veces, pero no se si anda la
     bosta esa 12:8 antes de acostarme y 13.7:9 despues.
     Tendria que ir al oculista pq puede ser glaucoma de angulo
     estrecho que te hace perder la vision. Los sintomas pueden venir
     continuos o discontinuos.

**** Hoy nuevamente crisis existencial
     En cierta forma reaparece en forma continua lo que siempre
     aparecio y es el derrotero hacia donde me dirijo y como he jugado
     mal mis cartas. Aunque quizas la forma en que he vivido sea la
     unica forma posible de acuerdo a mi personalidad y que en este
     sentido si hice y hago siempre lo que quiero.
     Desde esa indiferencia hacia el dinero en general, pero esa
     gigante hipersensibilidad a perderlo o a ser exaccionado o bien a
     tributar cualquier tipo de tributo.
     Y la cuenta regresiva cada tanto me marca los años, esta vez 12
     para la edad jubilatoria y en un marco que aunque muy positivo
     desde un punto de vista (vivir en el centro, posibilidad de
     conocer a alguien, pocas responsabilidades horarias y facticas)
     se me plantea como ambiente el dpto dentro de lo lindo y
     agradable como que es un poco insano, y si no el dpto el vivir en
     el centro en general. Pero todo es discutible pq no creo que
     hayan sido mas "sanos" los esquemas anteriores, ya sea cabaña o
     patricios y tampoco resolvieron para nada la crisis existencial.
**** Sobre el valor de lo que estoy haciendo en el contexto actual
     Yo aca tenia o tengo -vale decir- un plan en general y era
     programar el CMR y demas para tener una administracion realmente
     eficiente y a la vez mind-sweeped. [Debo poner un ejemplo: desde
     que tengo el pasador de clientes que quieren comprar me resulta
     altamente facil. Cosa que antes siempre fue un problema] Y asi
     creo que cuando el CMR tenga todos los modulos se puede lograr
     una administracion rapida y eficiente y alli poderme dedicar a
     generar venta extra, sin caer ahora en este momento en un estress
     excesivo y poner en riesgo la continuidad de la programacion.

     Esto puede leerse como una excusa para la vagancia y la evasion
     en el sentido de que mientras siga embarcado en el proyecto de
     programar evito el generar venta extra con lo que eso signifique
     para el momento actual. (Un poco influido por la particular
     situacion de estos tiempos en los cuales estoy acosado
     judicialmente por el fisco cordobes al pedo, pero ya
     irreversiblemente y junte otro frequito juicio justo en el puto
     momento en que la pila de años pasada sobre los juicios viejos te
     hacia pensar que podias safar o que nada iba a pasar. Y es dentro
     de ese contexto en el cual no me quisiera ver con un grupo de
     venta).
     O como una razon valida. Seamos realistas, en esta etapa del
     negocio basada en la venta a los clientes y en una mayor toma de
     riesgo facilitada por el sobrante de capital aparte de una
     gestion uniforme de la cobranza quizas como la que no tuvimos
     nunca estoy desarrollando un sistema de programas no digo como
     los que nunca tuve porque he tenido varios sistemas bastante
     ajustados y a medida, pero si un sistema (en produccion todavia)
     que se ajuste a la realidad actual. Tampoco podemos estar
     vendiendo 500k, cobrando 370k y soñar con aumentar un poco la
     venta, con retazos programaticos de otra epoca que ya no se
     adaptan a lo que hacemos ahora y encima estar alejado de toda
     posibilidad de parchear. Pq es mas dificil parchear que hacer
     algo de nuevo. Y seamos realistas la programacion requiere dos
     pasos, una aprender y la otra hacerlo. No tenemos recursos para
     pagar eso y no lo hariamos, como paso con ollas siljor cuando le
     pidieron una bonita suma de dinero para desarrollar un sistema de
     marketing.
     Nosotros tenemos una aplicacion de celular o sea de calle con
     posibilidad de testear padron y ver la totalidad de las cuentas y
     no creo que otra empresa similar la tenga programada por ellos
     mismos.
     (Ojo que si quizas tengan otras cosas, como un grupo de venta mas
     fuerte o una habilidad mayor para generar y cuidar el dinero)
     
     ¿Se podria programar y a la vez formar un sistema de venta?
     No creo. La programacion si bien es cierto que con varias
     desviaciones instrumentales (vim,emacs,org-mode,etc) me llevo una
     dedicacion full time. Si esa dedicacion no la haces no formas
     masa critica de conocimientos como para arrancar.
***** Bajon en la programacion??
     Hoy y quizas un poco ayer, peligrosamente he frenado la
     programacion, cayendo en un estado como quien diria de falta de
     inspiracion. Y aunque segui avanzando despacito con org-mode,
     incluso centrandome en estos escritos no arranco. Y eso que el
     modulo que tengo entre manos es muy necesario. Y eso que el
     contexto computacional que es el que se me chifla a esta altura
     entro en un punto agradable se puede decir con un vim muy lindo y
     eficiente para trabajar y un orgmode facinante para mis escritos,
     el cual tiene un nivel de usabilidad a hoy lo suficiente como
     para producir y pequeños incrementos diarios de conocimiento que
     no estan trabados ni frustrados. Y con el sistema git/gitlab
     tengo lo que siempre ansie, un sistema de escritos global, pq
     puedo escribir en mi compu, en la netbook, aca en la ofi y todo
     remite a un repositorio en la web que es accesible desde todos
     lados y a la vez puedo leer en formato bastante agradable el
     mismo archivo producido actualizado en el celu. O sea una
     sincronizacion de cuatro maquinas.
**** Despues de todo que se podria estar haciendo en ventas
     Es obvio que todo movimiento en relacion a las ventas tiene que
     tener las siguientes condiciones:
     1. No debe pasar por Fede (o sea p.e. a nivel reparto) pq ya esta
        demostrado en la experiencia de Fede y en la mia que cualquier
        persona extra que se deba atender ya sea conocida
        (Lesta,Franco) o desconocida, te haria perder tiempo, te baja
        la venta y no justifica ni siquiera lo que esas personas agregan
     2. No debe implicar aflojar o cambiar el esquema actual y
        reemplazarlo por un esquema superador (como que Fede se haga
        cargo de "toda" la venta, ¿y como se supone que eso se haria?
        dejando lo que esta haciendo y poniendo una oficina para
        buscar vendedores???)
     Entonces ¿que queda? que yo mismo desde la oficina genere
     vendedores que vendan pero que no tengan que pasar por Fede como
     repartidor, o sea una venta al estilo 2005 entregadas con
     bolsita.
     Pero eso aparte de significar un riesgo (lo cual puede ser
     totalmente calculado) genera una exposicion aca en el local que
     por ahora no creo que quiera o pueda hacerlo.
     
     Y hay que considerar lo que se podria hacer con lo que ya
     tenemos:
     1. comprar la kangoo para que se pueda abastecer mas
        eficientemente la venta
     2. cambiar el vendedor acompañante para que sea mas
        eficiente. Posiblemente Franco ya este quemado y una persona
        con mas espiritu de venta pueda con el mismo recorrido elevar
        un poco la facturacion.
*** [2016-10-13 jue]
    Hoy un moco total pq amanecio lloviendo y eso hizo que no vinieran
    dos chicos, menos mal que salieron un par, para ir avanzando. Pero
    lo mismo yo me clave, fui al banco esto estuvo bueno y lo mismo
    tengo que ir esta tarde por el seven. No me importa mucho eso.
**** apuntes sobre la alimentacion
     lindo: pq ayer a la tarde me tome una jarra de licuado. Bien
     preste atencion a la miel (aunque no parezca factor fundamental
     del licuado), compre y puse maca premium, y el resto lo de
     siempre, almendras pasas de uva, lino molido y chia, avena y
     manzana. Y quedo rico, muy rico y llenador. Y hoy se vio el
     resultado ... un sargento garcia de unos 30cm y varios cabos
     arriba y la sensacion de que habia vaciado el intestino no como
     los ultimos dias que iba en declive.

**** algunos temas en compras que hay que tener en cuenta
     algunos son transicionales y no enteramente ortodoxos pero es
     mejor hacer algo que nada. P.e. las lentejas en lata para
     combinar con el arroz. Le hice el uparsin-tekel-mene-mene a la
     verdu de la cañada pq al final no me cobro mal, y permite
     autoservicio y trae cosas buenas. Creo que tambien las compras
     deben tener el concepto de be-normal pq sino no se puede hacer
     nada. Y tengo que cambiar la alimentacion si o si urgente.
     Comparando el licuado, el cual no hay que abandonarlo y cuidarlo
     para que sea sustentable, con las opciones antiguas como pan
     manteca dulce y cafe, creo que esto gana y a la larga tiene que
     cambiar la bocha.

**** Hoy un tema nuevo para el estudio (que tendra que esperar)
     seguridad informatica. O sea todo un tema. Te agarra la paranoia
     de que la forma de actuar en la red es totalmente despreocupada y
     uno termina completamente expuesto, hasta en la forma mas tonta y
     ridicula.

*** [2016-10-14 vie] 
**** Hoy conoci tox
     que parece ser un protocolo para comunicacion pear to pear con
     clientes en android y en todos los sistemas.
     Para analizar
**** Me gusto la idea de html5 y python para alguna aplicacion
     que reemplace el androwish. 
     como una especie de sitio privado para navegar la info que
     tenemos en la base de datos.
     Pq parece bastante facil de programar la interface. Quedara para
     el futuro
**** Rescato lo que paso ayer o sea descansar y luego programar
     y al final la programacion fue mucho mas fertil e inspirada, que
     obligarse a estar cuando uno esta cansado o dolorido.
**** Experiencia de relax y fluir
   Luego llego a casa en un estado raro, no queria sentarme a
   programar, me sentia saturado, y me hice una merienda frutal con
   manzana, arandanos y frutilla y medio vaso de licuado, previamente
   haberme bañado tranquila y relajadamente, todo esto mientras veia
   la mitad de la pelicula que habia dejado pendiente, y la verdad que
   me relaje bastante, luego me recoste un rato (en realidad el orden
   de estos sucesos ya los olvide pero el resultado grato lo recuerdo)
   la cosa que despues si me sente a programar y la verdad que fue
   altamente productivo el tiempo que estuve, en cierta forma como
   destrabado. Quizas sea que haya aprovechado una base que habia
   hecho en la oficina, pero si me senti como que "fluyo" el trabajo y
   me senti como que podia terminar alli mismo todo el modulo, pero me
   fui a dormir. Esta mañana crei tener un par de puntaditas de nuevo
   en el ojo, aunque no son en el ojo sino en el arco superciliar.

**** el embole de esperar
     a pesar de que achique los horarios a mas no poder, me embola esperar
     y no tener tarea concreta que hacer. Y poder o necesitar hacer muchas
     cosas que no hago como limpiar un poco la oficina y uno tiene que
     esperar. 
     Eso tambien me embola con relacion a la Romi, pq contribuye bastante a
     que la oficina se ensucie y no es capaz de ayudar.
**** me desespera el dolor de cabeza
     me embola el malestar, el dolor, las dolencias y me empiezo a asustar
     y luego recuerdo que yo siempre estuve asi. O sea yo soy cronico. Con
     la diferencia que estos ultimos dos o tres dias he estado comiendo muy
     bien con relacion al 2006 y los emboles que me pego no son tan grandes
     como en el 2006. 
     Me pregunto que voy a hacer si me enfermo, si tengo ya mi edad y no
     tengo nada hecho. Nada organizado pq uno vive siempre en forma
     precaria. Y lo que es peor no tiene entusiasmo por lo que hace y en el
     fondo eso hace que uno no produzca.
**** de vuelta el fin de semana y la incertidumbre de no saber que hacer
     en las ultimas dos semanas he notado beligerancia de parte de las
     chicas, y no la he pasado bien en general. Y me encuentro con que una
     vez que me meto alla no salgo mas o sea me tengo que quedar hasta el
     lunes a la mañana y eso me causa imagenes negativas. Pq me pongo
     negativo y estar alla no me hace bien. 
     Me gustaria llevarme el auto para poder salir mas libremente, y quizas
     ir haciendo alguna cosita nueva. Vivo en forma muy rutinaria, y
     tambien los fines de semana son parte de esa rutina.
     pq en el fondo estoy preso de un circulo vicioso del que me da miedo
     salir.
     La realidad es que el circulo funciona asi:
- cuando estoy en tiempo de salida (el clock empieza el viernes a las
  18 pero se podria dilatar hasta el sabado a la mañana con suerte y
  mucha voluntad) entro en un estres de estar incumpliendo, de estar
  faltando a algo y a la vez comienza el miedo a que si me demoro las
  represalias seran grandes. Y esa incomodidad a la vez hace que no
  disfrute o no me concentre o no pueda hacer cosas positivas o bien
  relajarme y hacer algo no-utilitario para mi mismo.
- entonces voy, muchas veces obligado, y me llevo toda clase de
  elementos para distraerme, en especial la netbook y el celu. Y
  quiero seguir enfrascado en esos temas que son los unicos que me
  distraen y a la vez por falta de oxigenacion en otros temas o de
  disfrutar en otros temas.
- una vez que voy no me puedo volver, o sea quedo totalmente preso sin
  chances de acortar la jornada. (Al menos antes en Patricios el
  domingo a la tarde me iba y eso permitia organizar el comienzo de la
  semana)
- y la situacion ya llega al maltrato o distrato de las chicas y a la
  consiguiente reaccion de parte mia. Haciendose una atmosfera fea
  para estar.
**** hoy decido no someterme mas al chantaje
     quiero cortar el circulo vicioso al medio. Es decir el miedo a no
     ir pq eso significara no poder ir mas o que sea feo ir. Cedo por
     necesidad, quizas la necesidad de creer que voy a necesitar o voy
     a querer ir.
     De pronto las imagenes de mi mismo yendo alla y quedandome y
     siendo relativamente bien atendido, quizas con la libertad de la
     banda ancha etc. son imagenes que me quedaron de la epoca de la
     cabaña cuando realmente vivia en la necesidad, pero ahora no es
     asi. Y si ir alla me va a hacer caer en lo malsano, lo insano
     creo que es mejor no ir. Total un par de semanas que no me vean
     no va a ser nada. Y los tres chicos tienen la total libertad para
     venir, hasta la Cami. Ya no soy yo el que tengo que ir. O sea que
     podria ser una especie de nirvana nuevo.
     Pero el concepto basico es que no me voy a someter al chantaje de
     que tengo que ir todo el periodo o sino no voy a ir.
**** Siempre pense en el pasado que si alguna vez llegaba al punto w
     a nivel soledad me las iba a apañar e iba a empezar a salir de
     nuevo por mis medios. Iba a buscar otra forma de administrar mi
     tiempo que no fuera tan insana. 
*** [2016-10-15 sáb]

    Hoy un dia altamente productivo. O maso, depende como se vea. A
    pesar de haber estado atravesado por el dolor de espalda que se me
    fue y por la migraña y por el golpazo en la frente, me levante
    fui a comprar lo que tenia y limpie la oficina muy bien.
    Hacia falta limpiar la oficina, lo que no entiendo es todo el
    constructo que me hago alrededor o sea todo ese resentimiento
    hacia la familia, en especial la Romi. Pq supuestamente me
    gustaria que me ayuden. Pero no importa lo hice y disfrute
    haciendolo y creo que una limpieza asi cada 3 meses esta bien.
    Luego instale manjaro-Deepin que me parece bastante
    adecuado. Aparte de que tiene varias cositas muy bellas, anda el
    sonido out the box cosa que en i3 no y aparte aproveche para
    encriptar el disco. (Y debo decir que i3 empezo a pitear un monton
    en el arranque con un monton de errores.)
    La instalacion estuvo muy facil, y deje un instructivo en org para
    facilitarme la vida si tengo que instalar de nuevo.
    [[file:doc-deepin.org][Instalar Deepin]] 
    Hay dos cosas que voy incorporando que van a hacer una diferencia:
    - el trabajo con org que recien comienza y puede crecer. No quiero
      pensar la base que tendre en un año.
    - la alimentacion que retorno con fuerza. La fruta, la avena, el
      licuado el muesli, etc. Me hace pensar que puedo volver a un
      sistema fuerte pronto si le agrego ejercicio.

    No puedo olvidar que lo mas importante de este finde es no haber
    ido ayer alla. Fue un dia distinto y como dije productivo. Lo
    unico es que el clima acompaño un monton, no se que hubiera sido
    si el dia no hubiera estado asi.
    Pero lo que comenzo como una rebeldia pasa a ser un arruge pq uno
    no sabe si se bancara el destierro. E ih con sus buenos modos no
    deja de seguir amenazando.

    Hoy decrete el no va mas con relacion al migral. El lunes me
    instalo en el hospital a buscar una solucion. Debo cortar y buscar
    alternativas pq no hay forma de seguir asi.
*** [2016-10-17 lun]
 Hoy es el aniversario de la muerte de mi viejo. Y como siempre
 pasa desapercibido y nunca se hace ni una mencion, ni una
 reflexion. Como asunto olvidado. Quedara en cada uno
 obviamente. Es el ritmo vertiginoso de la vida. Es que uno tiene
 una agenda de carrera o de malos habitos y no se permite tiempo
 para la reflexion y el recuerdo.
**** Ih y los malosentendidos que produce el nirvana
Com era de esperarse la relacion fue un poco tensa y se lleno de
malosentendidos. Parte creo pq somos como somos y ya no vamos a
cambiar. Creo que la gente es como es y generalmente no cambia y
yo soy asi boludo y tengo esa forma de ser que genera dudas y
ella que es insegura cae en la inseguridad y ya no puedo arreglar
nada pq hay una tonelada de pasado que nos aplasta y ya no hay
vuelta atras. Es como si toda la buena letra de estos ultimos
meses se fuera al tacho por una escalada de inseguridad que
produce la situacion que uno haya cambiado la rutina.
Y el finde fue breve, y llenado con visitas a otros que abarcaron
la mayoria del tiempo y luego de nuevo el dolor de cabeza y luego
una tensa charla o monologo disipador de migrañas y de nuevo el
desencuentro.
Pero creo que el problema nace de que la falta de ganas de ir
para alla todo el tiempo. Pq ya las vivencias desagradables
superan las agradables. Y en esa ecuacion las chicas tienen el 70
e ih solo el 30. Pero al reducir las horas o cambiar el esquema
ya creo un ambiente propicio para el desencuentro y la
desconfianza y ya crece la beligerancia con la propia ih, lo cual
produce que en general yo quiera directamente no ir.
Hasta tal punto llegamos que creo que salvo que se produzca una
gran aflojada de mi parte (cosa bastante probable) o bien un
intento de acercamiento de ella (cosa probable pero menos) el
proximo finde directamente no quisiera ir. O no hesitar en
volverme ahi nomas a las 6 de la tarde.
**** Estoy solo solo
Como decia Dyer tengo soledad existencial. Y ya no tengo nada
para esperar de los demas. Incluso creo aparte de lo mas
inmediato que seria dejar de depender en cosas nimias (suplemento
de comida los findes, ir a lavar la ropa alla, tener alguien con
quien hablar,mediacion para tratar con los demas), tengo que empezar a ver por mi mismo y sin la
intervencion de ih de las cosas importantes para mi como cambiar
mi forma de vivir, empezar a previsionar para el futuro y ver que
estrategia de trabajo voy a tener. Y no puedo ser claro y
eficiente en la determinacion y consecucion de esos objetivos pq
al no ser una pareja real donde podamos tirar para el mismo lado
los intereses mios colisionan con los intereses de ella. Y el
formato de creer que ella comulga con los intereses mios es
falaz, pq tarde o temprano uno cae en la cuenta que los intereses
de uno estando con ella no avanzan sino que enferman.
**** Objetivos personales basicos
1. cambiar de forma de vida
2. ver la estrategia de trabajo a seguir
3. previsionar para el futuro
**** Fui al medico
Y debo decir que fue gracias a que ih llamo. Pq hubiera sido por
mi no hubiera ido. Y esta bien que haya ido.
Pero la charla derivo como siempre al tema pareja y me dio unos
muy buenos tips. En especial lo de hablar y hacerlo con altura. O
sea quedar de acuerdo con ella para salir y hablar
independientemente que las chicas quieran o no quieran. Para ver
si se puede salvar algo o no. Y en su caso dar por terminado pero
bien.

*** [2016-10-18 mar]
Hoy fui a sacarme los analisis. La prolactina la hice con hora y
media de las dos recomendadas y muy tranquilo. En realidad
viviendo aca, el tema analisis es muy fluido pq se hace antes de
la ofi. 
**** Org-mode ayuda o estorba
Noto que orgmode es groso pero que me cuesta aprenderlo y que no
me da mucha utilidad o me quita tiempo valioso, pq estoy faltante
de tiempo y sufro dolores de espalda estando en esta compu. Una
lastima pq la compu me gusta mucho, y el problema es el sillon. Y
la sensacion de urgencia que me da la falta de tiempo cronica.
En realidad creo que lo que me esta haciendo mal aca es las
posturas incomodas, en especial cuando estoy con dolor de
espalda. Por eso tengo la sensacion que en la oficina estoy mejor
y aca con la netbook no cambio nada, y lo mismo estoy
incomodo. Tambien puede ser este pantalon, o algo externo, pero
definitivamente la netbook aca no es ergonomica.
Quizas sea nomas una meseta y uno tenga que atravesarla.
**** Reparacion historica en org-mode
luego de la migraña y en plan de estar tranqui en la netbook en la
cama y sacarme el torbellino lisp de la cabeza, me puse poco a poco y
logre un acomodo interesante con org-mode.
Comenzando con empezar con un emacs puro, hasta en colortheme. De
fabrica con .emacs nulo. Y fui poniendo solo lo que necesito, los
bullets, el keybind a agenda, dos variables para que la agenda no se
repita tanto, el indent automatico y el autofill automatico.
Incluso logre hacer andar el habits.
El resto es acomodar los timestamps mal puestos para que no incidan en
la agenda. Y todo joya. pq en realidad para que org-mode ande bien
necesito un emacs puro. pq el evil me molesta pq interfiere con los
comandos especificos de org-mode, y al final estoy aca por org-mode y
para escribir no hace falta vim aca, no es lo mismo que programar.
Queda pendiente para mañana el drill mode pq ahora es demasiado y
bastante lo logrado. Falta solo ag pero si se instalo desde aca.
**** Prueba piloto a analizar y probar sobre no ir a la ofi a la mañana
veremos como reaccionan los chicos, pero creo que es un grupo muy
compacto y no necesita salir de ofi para trabajar. Y si puedo
prescindir de la ofi a la mañana podria tener 4hs puras sin
interrupcion y sin molestias para programar por dia, eso puede
significar que termine el CMR total o sea con modulos pagos y ventas y
luego desarrolle django para el celu. Y de paso me saque el temor de
la mañana en la ofi por ahora. La bocha estaria en prender la compu a
las 8hs y a las 12.30hs apagar con la jornada de programacion ya
hecha, y dejar la tarde en la oficina, y si quiero un rato a la noche
con mis org-files, pero ya la programacion se concentra alli.
*** [2016-10-19 mié]
Hoy comienza la prueba piloto de la mañana. Puse el reloj a las 7.45 y
me levante en un minuto. Y prendi las maquinas a las 8 en punto.
Y hoy amanece lloviendo, en casos asi creo que es mejor que ellos
  tengan las fichas y salgan mas tarde como paso la semana pasada.
**** resultados de la primera jornada de programacion
muy positiva, como fue tambien muy positiva la jornada de anoche con
la netbook en la cama poniendo a punto org-mode en una noche.
No es mucho quizas lo que objetivamente se pueda marcar como hecho,
pero se podria decir que termine el proceso de intimaciones, no solo
la parte programatica (cargado de comentarios de la entrega, y
visualizacion de los intimados en las planillas) sino la parte
conceptual que tambien se define, donde uno define los limites de lo
que esta haciendo. Hasta donde voy a llegar con cada modulo, pq por
ahi hay ideas contradictorias o algunas que no valen la pena. En ese
analisis orgmode es fenomenal, pq el brainstorming de proceso de
intimaciones fue muy fertil y muy rapido, y se fue nutriendo con el
paso del tiempo, y con los flags done, canceled o waiting tenes la
vision clara de que es cada item y como se dejo. Esta muy bueno el
adagio ese que dice "Piensa dos veces programa una" pq uno se larga a
hacer cosas que luego en la practica misma ve que no son usables y no
sirven. o que falta algo. Y que algunas ideas no tienen sentido, o son
innecesarias.
**** Que paso hoy con mi asertividad?
¿que paso que acepte como un pelotudo la tarjetita vea -que no me
interesa para nada- otorgando un monton de informacion al vicio?
¿Donde me colgue?.
Y que paso que desde la mañana tuve que justificarme ante ih de la
circunstancia que me quedaba aca a programar, cuando soy yo mismo el
que decide lo que hago.
*** [2016-10-20 jue]
Hoy el segundo dia del sistema, dormi muy bien anoche, me costo
levantarme y recien me sente a las 8.15hs. No fue muy importante la
programacion de hoy pero saque adelante muchos issues anotados en
gitlab y agregue algunas funciones como ver los recorridos
(recuperando el skill sobre tree, lo que no esta mal) y me planteo o
replanteo otras modificaciones o agregados que van haciendo falta en
el trabajo real, como el tema gestion de documentos o el tema pivot.
Creo que falta mucho trabajo de analisis, para eso orgmode es genial.
**** Fuerte sensacion de inseguridad
luego del lapsus inexplicable de ayer en el super, anotando todos mis
datos reales por un descuento de seis pesos, y el golpe animico de ser
confundido por un jubilado, y el haber huido de la oficina a la mañana
siento cada vez mas paranoia sobre el tema judicial, y a la vez no le
veo a la situacion salida facil, porque me siento muy debilitado y
enfermo como descuidado y no me siento muy fuerte en mi mente como
para iniciar un proceso de venta o trabajo fluido. Creo que la
exposicion publica en oficina va haciendo su trabajito y me deja en
este estado, que es desde todo punto analizable falso, pq si vamos al
caso por lo maximo que me persiguen en ese momento es por una deuda de
15k la cual no creo que llegue al nivel de bloquearnos la oficina
definitivamente.
Este tema da para un analisis mucho mas tranquilo y extendido.
P.e. no puedo salir del estado de crotura, es como que no quiero
hacerlo me parece.
**** articulo de psicologia (revista) como que me describen
En el TOC hay una propension a gozar del fracaso, y las descripciones
que da son bastantes parecidas a las mias solo que yo posiblemente sea
mas extremo pq no tengo pareja, pero tenemos muchos parecidos.Increible
parece escrito describiendome a mi. Yo creo que da para la relectura atenta.
**** los escritos anteriores tambien son una fuente de guia
A pesar de que es dificil aprovecharse de lo volcado alli por el
desorden y la magnitud creo que alli hay muchas pistas que se pueden
ordenar. P.e. recien vi en el cuaderno aparte de muchas ideitas
sueltas sobre la programacion y el registro del avance que el 7/9
sentia fuertes dolores de espalda, justo lo que siento ahora hasta el
punto que quizas ponia un articulo sobre ello. y eso fue hace 45 dias.
**** Como se van articulando los escritos en este diario
Por lo que veo desde el 10/10 que empece a cronicar con orgmode es mas
facil pq se hacen encabezados secundarios muy facilmente debajo de la
fecha en cuestion y de ultima es mas facil hacer una recorrida rapida
y detenerse en aquellos puntos que sean interesantes en cada
momento. No siempre nos agobian los mismos temas.
**** ¿Es factible el pasado de los cuadernos aca?
Poco, por el tiempo que lleva, y los unicos tiempos muertos que son la
oficina no los tengo conmigo, la unica forma seria hacer una cierta
cantidad de hojas por dia como rutina, a los fines de contar con un
registro mas ordenado. Y de paso aprovechar el pasado para estructurar
asi sea con un solo subencabezado titulado el contenido, cosa que
sirva como con los actuales, sino mucho no va a servir.
¿La seguridad de que no se pierdan? Porque ese siempre fue el karma de
los escritos en general. Ahora tengo el control de version.
En especial seria interesante recuperar los escritos que estan en
malas condiciones de conservacion (mayormente el 2015 en hojas
sueltas) y el que se encuentra en otros lados como los que pase a
google-doc, la bitacora en zoho y los de dia.tcl, estos mas faciles pq
los puedo copiar y pegar. P.D. ya pase la de zoho 
*** [2016-10-21 vie]
Dentro de todo hoy estoy contento que decidi ir nomas al electro, fui
y volvi en un pedo, todo muy facil, lo cual creo que debe servir para
experiencia.
**** Percepcion del estado fisico en que me encuentro
¿Soy consciente del estado fisico en que estoy?. No siempre. O casi
nunca.
***** El hacer algo con esfuerzo te conciencia
 El principal beneficio de hacer algo, como las dolorosas tres
series del habito actual buscado, es que te conciencian sobre el
estado calamitoso en que estas. Maxime si las haces frente al
espejo. Una forma de no tomar consciencia es no hacer nada y uno no
enfrenta la dificultad y no la ve, la olvida, la ignora.
***** Incentivo al hacer dolorosamente algo
hice un paralelo con python, si como esta cronicado, dolorosamente me
parecia que no iba a avanzar pq me costada enfocarme en lo mas minimo,
y ahora avance un monton, es que se puede recuperar, y hago ese
paralelo con el estado fisico pensando que puedo recuperarme.
Y me recuerdo ese capitulo de Homeland donde el tipo dolorosamente
comenzo su recuperacion fisica luego de estar confinado mucho tiempo.
***** de nuevo la idea del verano maldito
veo el espejo y me digo otro año sin poder hacer nada, incluso me va a
costar evadirme alla en el marques.
tengo a lo sumo tres meses.
***** El mayor problema el creer que uno luego va a remontar
es mi mayor enemigo, fracaso porque pienso que luego me voy a
levantar, pero llega el momento en que ya quizas no podras levantarte
mas o te veras seriamente disminuido. Esa creencia del paso a paso es
mas falaz que no se que. Y muy dañina. Mas me convendria empezar a ser
conciente de mis limitaciones serias.
**** Metodo de estudio
Comienzo a usar un metodo de estudio nuevo con repasos espaciados
enteramente administrado por mi. Lleva un segundo poner el todo y el
schedul para el dia que queres y la repeticion que queres. Luego una
vez cumplido se agenda solo y queda el registro. O sea un
dulce. Comparado con el año 96 cuando lei por primera vez la
repeticion espaciada y hacia los cuadros mentales con fechita abajo,
esto esta mejor.
Con practica mejorare los items, para hacerlos esquematizados y
permitir un poco la recordacion, pero dentro de todo lo bueno es que
no solo es palabras sueltas (alli no le discuto a anki) sino temas que
tambien se olvidan y es mucha perdida de tiempo volver a verlos, o
perdes en empuje si no fijas conocimientos, pq no podes avanzar.
**** tema rejas de subsuelo
En realidad a mi me conviene un sistema de puertas cerradas y a la vez
no deberia meterme mucho pq es baladi. O sea que no me importa. Ya
veremos en un contexto en el cual ponga avisos o pretenda hacer otra
cosa. Por ahora estoy fugado o en estado de fuga. Trabajar a la tarde
me da mas gusto que tener que venir a la mañana. Lo que hagan con la
reja no me importa. Esta bien que me sale el caracter de adentro y les
tiro la legalidad encima y mis doce años de propietario, pero en
realidad no tendria que ser un tema. Habria que dejarlo y estudiarlo
bien.
O sea habria que dejarlo que se vengan con algo mas concreto, pq las
conductas individuales o grupales se van diluyendo con el paso del
tiempo.
Quiero ver si de aca a uno o dos meses siguen con la politica de
puertas cerradas.
**** tema cobradores a la tarde
hasta ahora venimos con cobros similares o mejores que si hubieran
salido a la mañana. El unico que me presenta dudas es PG y es el unico
que me pregunto por la politica de entrega a la tarde. A PM obvio que
le beneficia y cl anda muy bien pq el tipo es muy responsable. Y ram
ya estaba acostumbrado de antes. 
Y desde mi lado un avance de 3 horas puras por dia durante muchos dias
puede marcar una diferencia muy grande en la programacion. P.q
estariamos en unas 15 hs semanales de trabajo puro. Y eso capaz se
note.
**** El gran desafio para pensar un sistema de venta nuevo
Creo que una vez que la programacion avance y abarque todo necesitare
un sistema de venta nuevo que permita potenciar el sistema.
¿Podre generar nuevamente la magia?
Esta bien que un sistema como el de 2006 tenia toda mi dedicacion,
pero no tenia el flujo de caja que tenemos ahora. Y el tema seria si
sere capaz ahora una decada mas tarde meterme en ese baile de nuevo.
Es sabido que la gente da dolores de cabeza en cualquier epoca. Y no
estamos exentos de renegar de nuevo. El problema creo que es la
exposicion judiciable del local, eso es lo que me tiene a mal traer,
pq si tuviera una oficina digamos tipo cristina, con el escritorio y
el sillon este puedo estar una rutina de 6 hs como empece aca y tener
los promotores y/o avisos que necesite.
Y considerando la situacion de fluidez que tenemos no deberia ser
problema, igualmente con el tema de la ropa. No entiendo pq me da
gusto o es una desidia no gastar en ropa y eso incide en que uno no
mantiene un nivel adecuado que sirva como presencia.
**** Sacar una cosa por vez
La estrategia que uso ahora es compactar el tiempo libre para mayor
productividad pq al final los cobradores cobran igual y yo programo
mucho mas que antes. Obviamente cada modulo que agregamos y cada
conocimiento que fijamos para poder luego mantener el sistema es
importante, pero falta mucho aun para que el cmr este completo y no
creo que este en condiciones de largar el sistema ya. Creo que queda
para enero pase lo que pase.
Tambien tengo por delante el withdrall y empezar con el dentista para
que no explote la situacion cuando menos lo necesite.
**** porque no me entusiasmo mas en un proyecto de algo
creo que simplemente sobrevivo. y a la vez pierdo tiempo en cosas que
no tendria que perder tiempo. recien ahora en ese sentido he
emprendido un par de caminos para corregirme. la creacion de habitos y
el hacer las cosas basicas que necesito hacer.
pero no nos confundamos tenemos mas remoras que antes y no cuento con
el empuje de antes.
como cronique antes el creer que el pequeños pasos reiterados te puede
cambiar de situacion, o sea que es una gran procrastinacion, porque es
una racionalizacion de la dilacion, o sea es el creer equivocadamente
que uno va a cambiar.
por eso es importante el releerse pq en años anteriores me daba vuelta
este tema que era si realmente uno puede cambiar, o sea si el cambio
es posible, y alli entraba el tema de los habitos.
**** sintomas depresivos
un gran sintoma depresivo es el tema ropa. la dejadez con que me
manejo en ese tema. hoy mientras esperaba el ascensor y escuchaba
algarabias juveniles de viernes noche, pensaba que menos mal que me
invitaron aca y puedo estar un rato con la familia pq cual era el plan
de haberme quedado, programar, ver la serie nueva, escribir, releer,
reconcentrarse en uno mismo. Y mientras pienso en el fondo que ese es
el camino (no se a donde) camino que me da miedo dejar sigo estancado
muy estancado y en el marasmo (palabreja que esta en mis escritos hace
demasiados años). 
Una parte que demora demasiado el salir es no hacer las cosas a fondo
o dejarlas o cortarlas. Por eso creo que si sigo los escritos puedo
volver a encausarme.
*** [2016-10-22 sáb]
:LOGBOOK:
CLOCK: [2016-10-22 sáb 16:25]--[2016-10-22 sáb 16:40] =>  0:15
:END:
**** compramos la kangoo carajo
hoy fuimos con el Fede a entregar una cuenta a barrio ituizango y
pasamos por autocity y compramos la kangoo, me parece que un buen
negocio pq pasamos del gol a la cero km con solo 125 lucas que en este
momento tenemos. Esto lo completamos con la fase dos de poner a ih a
trabajar con el y fase tres poner al franco en oficina para comenzar
un sistema de venta en el local.
**** hacia un sistema de ventas en el local
:LOGBOOK:
CLOCK: [2016-10-22 sáb 20:27]--[2016-10-22 sáb 20:43] =>  0:16
:END:
el unico riesgo que correria seria la exposicion de equis cantidad de
cortinas alli, que no serian muchas pq tengo la chance que fede me
deje lo que necesito dia por medio. 
supongamos en el peor de los casos que tenga un nivel de cien
cortinas, o sea dieciocho lucas o veinte lucas. pero si no vienen o si
vienen y solo hacen un embargo preventivo en el medio yo cada
cincuenta lucas que pierda de vender por miedo, pierdo definitiva y
realmente veinte lucas, y cincuenta lucas las venderia por semana, o
sea que por semana pierdo lo que pienso que podria llegar a
perder. Mas alla que un alquiler extra de digamos tres o cuatro lucas
en cuatro meses me fuma lo que supuestamente podria perder.
***** que venderiamos
solo cortinas
***** que plan 
una cortina suelta en 4 cuotas de 195 
***** que ganancia daremos
10% - o sea 3200 por dos cortinas por dia.
***** una cortina sin anticipo la segunda con cuota
eso nos previene de mayores riesgos pq la segunda cuota es alta y
cubre los costos
***** que papeles pedimos
fotocopia de dni y servicio, o foto enviada al wassap puede ser del
telefono del cliente. Ya se veria.
***** riesgos del sistema
****** embargo en la oficina de la mercaderia plus lo que habia en oficina
****** inspeccion municipal
****** los casos 508 o sea fraudes en la calle
- autorrobo de la mercaderia
- cobro de primera cuota sin rendir
- vayan a entregar las primeras ventas y desaparezca
***** ya no es lo mismo el riesgo asumido como en el pasado
- ahora una cortina o dos arriesgadas no duele tanto como en ese tiempo
- ahora pienso que seria mas desconfiado p.e. pediria si o si dni a
  los empleados y le haria firmar un contrato, que permita subirlos al
  seven en caso de que me estafen, y haria firmar una planilla de
  salida como a los cobradores con una buena letra de compromiso.
- en el caso de los cobros, creo que en aquellos casos que amerite
  (p.e. el negro que me cago en rosedal o el 401 los haria chequear
  por los cobradores al otro dia de la entrega)
- Y tendria el apoyo de contar con dos conocidos para empezar, en
  especial al Franco que me podria apoyar en caso de entregas.
***** la diferencia mas grande es que ahora no necesitamos esa venta
o sea aparte de estar mas capitalizados, no necesitariamos esa venta,
por eso podria regular a los elementos complicados por medio de
mandarlos a algun barrio mas dificil y no tanto a algo facil y de paso
peligroso. donde puedan vender mas de dos con facilidad.
***** no me sirven los que quieren ganar mucho o hacen muchas ventas
sino los que la luchan de abajo y se conformen con un monto mas discreto.
***** es mucho mas liberado el sistema si se autoentrega
porque eso da mas libertad en zona y en la permanencia o duracion en
la zona.
*** [2016-10-23 dom]
***** puede ser un enfoque por dia con el famoso 300 por dia pago diario
con tres cortinas entregadas.
El riesgo si salen 3 cortinas a reparto y no vuelven pq son choreadas
es perder 540 y si pagamos es 300. O sea que el chico puede querer
chorear pq las puede hacer a 600 o 900 pero de ahi corre la parte
firmada. Contrato, fotocopia de dni y hoja de salida. 
El tema es que se puede pagar 80 por cortina y un premio compensador
de 60 a la tercera cortina, cosa de generar la chance de tres cortinas
por dia. 
Un par de meses atras la chance de hacer 300 por dia fue grosa y
muchos vinieron con ese plan, luego se complica con el sistema de
oficina.
Pero asumiendo riesgos estadisticos con respecto a la venta global
controlada por limite de venta y seven, y liberando escollos mediante
la entrega personal de cada uno se pude hacer la liquidacion diaria.
***** liquidacion diaria, el camino a la simplificacion
:LOGBOOK:
CLOCK: [2016-10-23 dom 16:22]--[2016-10-23 dom 16:32] =>  0:10
:END:
que sea un trabajo de pago diario, hace que solo tenga que tener
planillas con el dia que esta en curso y una vez liquidada se firma y
se archiva, o sea no les debo nada solo lo de hoy, como tienen hoy los
cobradores.
Elimina la peligrosa planilla mensual y elimina el tener
malosentendidos.
Lo unico que queda es el choreo de parte de ellos de la ultima tanda
de cortinas, lo cual es malo pero no entorpece el minimalismo del pago
diario.
Ademas el que puedan ganar 300 por dia es un gancho, o sea el pago
diario para aquel que esta en la lona. Y es un incentivo para que
trabajen bien o sea para que se esfuercen y hagan el dia.
Se podria aceptar que si hay tres ventas y no se pudo entregar pq le
fallo el cliente pueda entregarlo mañana y cobrar mañana el dia sin
perder el premio.
Cobrar por dia elimina tambien el tema de los vales, y el problema de
la liquidacion.
***** Que modulos necesito
****** pasador de pedidos 
necesita solo arreglar el tema del articulo
****** planilla de salida y cobro de liquidacion de comision
****** registro de jornales
****** emisor rapido de planos
y planos editados con los colectivos actuales
***** El pasado de datos y chequeado se hace sin promotor presente
algo que fue una molestia en el minisistema actual fue tener que
chequear el vender o no (seven o dni antes) frente al promotor y
cuando el promotor te rinda.(caso hony y lesta)
Ahora no haria falta pq al ser ellos mismos los que entregan mañana no
hace falta hacerlo
***** otra ventaja de que sea plan diario- que se vayan solos
el gran pain del sistema 2013 fue que la gente captada con un sistema
mensual no produce bien, uno tiene que enmascarar esa situacion al
comienzo y luego se complica sacarlos, como paso con el megagrupo
antes de echarlos a todos y dejar los 7 que andaban bien. Al ser tan
transparente asi la rendicion y entrega, el que anda mal y no produce
se va solo. y te despeja el sitio para que sigas incorporando gente en
el futuro.
*** [2016-10-24 lun]
CLOCK: [2016-10-24 lun 11:13]--[2016-10-24 lun 11:28] =>  0:15
Hoy comienzo la semana listo para ir al medico. La prioridad numero
uno es buscar una solucion razonable a la toma de migral. No es moco
de pavo. 
Uno a veces prioriza el dia a dia, el trabajo o la obligacion como
hice siempre y al final lo mas importante es la salud y no caer a ser
una carga a los demas si eso se puede evitar.
Uno va a lamentar no haber hecho algo antes.
Anoche dormi bien pq estaba cansado, pero tuve mucho dolor de espalda,
no podia dormir de ninguno de los dos lados. Creo que puede ser un
estiramiento debido a ejercicios en frio o mala fuerza.
Ayer observe que ya las series las hacia mucho mas facil.
Y el habito de los ejercicios de espalda ya estan siendo
ultranecesarios.
Se debe articular el orden de trabajo con las necesidades
propias. P.e. la movida de cambio de horario de la oficina va en el
sentido ese o sea poner el negocio al servicio de uno, o bien tener un
minimo de respeto hacia uno mismo y las cosas necesarias.
O se tratara de fiaca y desidia para ir al medico. Como me paso el
viernes que dije que no iba a ir pq no tenia ganas pero fui porque era
obligacion ir. 
**** sistema anexo de venta sigo considerando
**** cerrara con 300x3entregadas
tengo la chance de probar con lesta y franco. Pero creo que es un
trato justo. Entregas 3 cortinas y ganas 300 mangos, sino 80 por
cortina. 
**** rentabilidad esperada
aun pagando 100  con un 10 de inc, da unos 39% de rentabilidad. O sea
que vendiendo unas 6 cortinas por dia, nos generaria una rentabilidad
extra de 35k. 
**** flujo de oficina
CLOCK: [2016-10-24 lun 23:04]--[2016-10-24 lun 23:17] =>  0:13
pienso seguir manteniendo los cobradores a la tarde y poner los promos
que retiren las bolsas de 9.30 a 10. 
**** Raconto de cosas positivas a hoy
***** org-mode para todo tipo de registros y escritos
***** el control de habitos que te motiva
al tener org-mode todo junto, y al estar uno en el flujo de trabajo
diario siempre conectado (incluso creo en epocas de no programacion
creo que los escritos siempre estan)
***** git obvio que te mantiene simpre actualizado
***** clockear el tiempo es fascinante
mas en el caso del control de programacion, o sea clockeo el tiempo
real que paso programando y registro que es lo que hago, cosa de ver
bien claramente los avances. Y clockeo (me tengo que acostumbrar) el
tiempo en diario y en diario de programacion. -Los org clockeables
debo poner como hice con este arriba clockear para que me habitue
hasta que aprenda a hacerlo automatico.
***** el poder modular de programar con clases python
hoy en 70 minutos reforme una clase para agregarle funcionalidad extra
muy importante y luego en los ultimos 23 minutos de esos 70
(incluyendo un pitfall sino hubieran sido 10 minutos le agregue una
superfuncionalidad).
Lo bueno que ya la clase queda asi y se puede poner en cualquier lado.
***** la huella que realmente deja hacer un ejercicio habitualmente
aunque parece moco el ejercicio lo hago ya sin dolor, y lo hago mas
cantidad, lo cual no significa que sea facil hacerlo y que el habito
ya esta, sufro con hacerlo. Por eso el poder del habito.
Creo que el sistema de habitos de org es poderosisimo (obviamente en
un contexto previo de usuario de la interface, sino pasaria a ser un
programita mas en android que uno se olvidaria de abrir).
Recuerdo en ese libro deusto que hablaba un poco de GTD y decia que el
llevar una lista o cuadricula en la cual anotaramos dia a dia (o sea
el metodo seinfield) era la herramienta mas poderosa.
***** es fabuloso que pueda comenzar un sistema de venta independiente
pq eso me da mas libertad e incentivo de trabajar.
*** [2016-10-25 mar]
CLOCK: [2016-10-25 mar 08:44]--[2016-10-25 mar 08:52] =>  0:08
**** Sintoma feo anoche                                    :tinitus:apnea:
ayer desde la mañana senti una sensacion en el oido izquierdo que yo
digo que es un tinitus agravado. Era como un oido tapado, me duro todo
el dia con zumbidos y fea sensacion como que tenia algo en el oido,
pero me tocaba y no me dolia, cuando fue llegando la noche la
sensacion ya se puso exasperante y felizmente acepto el uso de la
lluvia artificial, aunque anoche dormi casi sin lluvia, pq creo que el
ruido propio ya era suficiente.
Apnea: y cene una sopa que me cayo para la mierda. Estaba muy aceitosa
aunque congelada, era la ultima de atras, traida de ih. Tenia gustito
raro, pero tenia hambre y no tenia otra cosa. Y me inflo como globo la
panza pero sin dar la sensacion de puntada de dolor como otras veces
con el aire, sino que -con mucho sueño que estaba- la sensacion de
apnea, o sea despertar cuando uno estaria empezando a dormirse con la
sensacion que habia dejado de respirar.
**** tramite kangoo
CLOCK: [2016-10-25 mar 12:53]--[2016-10-25 mar 12:57] =>  0:04
***** DONE ir a rentas/comprar bolsas 
SCHEDULED: <2016-10-26 mié>
***** DONE ir a marques/llevar fondos
SCHEDULED: <2016-10-26 mié>
traer el jueves las cortinas que pueda llegar a necesitar cosa de no
tener que adelantar llevada a oficina en estos dias tan complejos, si
es posible que pase hasta el sabado.
**** vuelta a emacs!!! en forma natural                    :holywar:emacs:
CLOCK: [2016-10-25 mar 19:45]--[2016-10-25 mar 20:02] =>  0:17
hoy volvi a usar emacs pero en forma espontanea. Eso es lo raro. No me
lo propuse ni tampoco proviene de la lectura de nada. Aunque he estado
leyendo el epub oficial de emacs. Creo que fue porque como uso mucho
org y tengo una configuracion basica sin tocar aca a la cual le voy
agregando cositas muy utiles, que han hecho la diferencia
***** configuracion que hizo la diferencia
aunque el paso a emacs se hizo solo y no tiene que ver con esto, y
tampoco copie ninguna configuracion ni nada.
- hl-line-mode, linum-mode, auto-complete-mode para el hook de python
  o sea que esas tres cosas que ayudan en la programacion se activan
  solas alli.
- el clockeado y la insersion de fecha inactiva
- los relativos a orgmode
***** Particularidades que uso en emacs vs vim
| accion                      | emacs             | vim     |
| duplicar linea              | C-D               | yy-p    |
| mover lineas                | M-up/d            | idem    |
| borrar linea                | Ca-Ck o Ck        | dd o d$ |
| ppio y final linea          | Ca/Ce             | 0/$     |
| linea siguiente y previa    | Cn/Cp             | j/k     |
| Caracter siguiente y previo | Cf/Cb             | h/l     |
| Borrar palabra              | M-d               | cw      |
| seleccionar                 | S-mov/mouse/C-spc | v-mov   |
| copiar                      | C-w               | yy      |
| pegar                       | C-y               | p       |
| cortar                      | M-w               | dd      |
| buscar adelante/atras       | C-s C-r           | /?      |
| buscar tags                 | M-.               | :Ack    |
O sea que por lo visto hay mucha posibilidad de quedar aca en emacs,
aparte esta la integracion con orgmode. Y creo que en general como
ecosistema es muy superior, pq permite un mejor aprendizaje y luego
queda la posibilidad e aprender lisp.
**** sigue el tinitus :tinitus:
a pesar de que me levante bien, en estos momentos sigo padeciendo el
tinitus de nuevo, incluso con una sensacion que envuelve mas alla de
la oreja y me da la sensacion de que me estallara la cabeza por
tension alta. Me mido y da 13.9/9.1. Estoy cansado y no me levanto del
sillon. Una lastima pq el estado animico es optimo.
**** sobre la maca negra
desde hace un par de dias he experimentado un mayor interes hacia las
mujeres con el consecuente feedback. A pesar de la falta de tiempo que
tengo quizas sea el aporte de la maca negra.
*** [2016-10-27 jue]
CLOCK: [2016-10-27 jue 13:55]--[2016-10-27 jue 14:06] =>  0:11
Hoy sigo bastante mal con relacion a la migraña y al estado fisico en
general, no sabiendo para que lado correr si darme al corticoide o
tirar un poco mas.
Y transcurro una semana un poco desarticulado por los compromisos
extras que se agregaron con motivo de la kangoo( el sabado ir a la
concesionaria, el martes reunion con los promotores y hoy jueves ir a
pagar y ayer miercoles el super plomo de dgr. Y queda todavia el
martes proximo la verificacion y el jueves que viene el retiro). Todo
esto me desarticula, me saca tiempo que puedo dedicar aca a lo mio y
me pone en situacion de tension o estres. Y a eso le sumas que te
agarran unos malestares muy importantes al medio, como paso ayer y
tenes el combo completo.
Aparte se ha enfriado un poco la situaicon con ih alla.
Y experimento una atraccion fatal hacia la computadora, en especial
emacs en este momento que llega al paroxismo del daño fisico. Y lo
peor que no se traduce directamente e inmediatamente en produccion. Al
menos ayer y hoy.
**** Resolucion
- emacs se mide en años, no desesperarse ir de a poco
- el clock esta muy bueno pq te mantiene informado pero no abusar en
  abrirse a muchos items pq no se va a poder seguir el rastro
- cuidar la salud en estos momentos
- de ultima no voy alla el sabado y me recupero
*** [2016-10-28 vie]
CLOCK: [2016-10-28 vie 20:35]--[2016-10-28 vie 20:50] =>  0:15
CLOCK: [2016-10-28 vie 11:51]--[2016-10-28 vie 11:51] =>  0:00
CLOCK: [2016-10-28 vie 11:05]--[2016-10-28 vie 11:13] =>  0:08
Hoy debo notar un par de cosas, una es el estres que obviamente me
causa el tema de la compra del auto y como esto me cambio la rutina,
incluso ayer pensaba en hacer un diario de cambio de rutinas para
anotar las cosas que me sacan de mi rutina habitual para llevar cuenta
de eso.
La otra es una confirmacion mas de la propension a fracasar que tengo
como lei en el articulo de toc, pq sino no se explica los terminos en
los cuales interactue con ih estos ultimos dias. De una beligerancia
tal que no se entiende y sembrando dudas en un terreno que es
innecesario sabiendo ademas que sere objeto de escarnio pq ella aparte
de ser bastante lestal, tiene motivo pq se ve afectada y ofendida por
lo que digo. No entiendo pq me soslayo yo en la masturbacion verbal de
contar cosas que solo me incumben a mi.
Por ultimo muy bien como comenzo ayer a funcionar el habito en la
oficina. A la tarde me encuentro no se como y me hago una serie, asi
de una, eso me cambio no solo el fisico sino la percepcion y alli
mismo luego de un ratito me hice otra serie y ya ahi me cambio la
decision y llame a la de arica para resolver el tema (lo cual fue
altamente positivo) y a posteriori hice la tercera serie. O sea me
despache las tres series en la ofi sin problema.
Creo que todo en base al habito.
Nuevamente parado en la programacion y muy enchufado en la herramienta
hasta el punto de lo innecesario ya, pq caemos a un nivel que
sobrepasamos lo que hace falta para fluir.
**** Cuanto tiempo te lleva programar
Estos ultimos dias he notado algunas cosas, que estoy enfermo ya con
emacs  y segundo que la programacion me cuesta y me cuesta que sea de
calidad. Incluso hoy vi que si bien es cierto que funciona maso no es
muy espectacular. Hay modulos que les falta mucho pulimiento.
Y quiero poner com ejemplo el pasar pedidos, lleva 4 horas!!! y no
tiene nada. A ese ritmo le faltan 6 horas. Y en realidad con ese
tiempo terminare teniendo casi lo mismo que antes pero en python y con
una pila de tiempo invertido.
Esta bueno tambien que el clock te permita ver tambien exacto cuanto
tiempo pasas en maquina en cada parte del proyecto.
Como dije antes. emacs es algo para medirlo en años. Y la curva de
aprendizaje que llevo es muy alta.
**** emacs va cambiando mis habitos
la integracion de la agenda, los habitos y los escritos y el control
del trabajo va a terminar cambiando la forma de hacer las cosas
siempre que siga en ello.
*** [2016-10-29 sáb]
CLOCK: [2016-10-29 sáb 10:32]--[2016-10-29 sáb 11:01] =>  0:29
CLOCK: [2016-10-29 sáb 09:07]--[2016-10-29 sáb 09:38] =>  0:31
**** reorganizacion de los diarios
Pienso en re-organizar todo el sistema de escritos para no dispersarse
y tener un sistema de mente-barrida y a la vez tener los elementos de
informacion necesarios para luego trabajar sobre ellos cuando hagan
falta.
En general pienso que se divide en dos grandes temas o bien tres
temas:
1. programacion concretamente: o sea el diario de programacion con el
   control de tiempo e items de avance y el diario de desarrollo donde
   se estudian los aspectos teoricos y de alli se va a fichaje.py a
   trabajar.
2. diario personal y registros personales, donde "trabajo" sobre
   registros personales o bien que no tienen que ver con la
   programacion del proyecto, y es alli que yo digo que debo unificar
   los archivos, mas que todos aquellos que son de escritura, para que
   podamos clockearlos unificadamente. Al menos los de servicio (como
   los especificos que apuntan a habits y agenda no son archivos que
   se visiten muy mucho en forma directa).
3. estudio, que es donde vamos volcando lo que voy aprendiendo y no
   necesariamente es desarrollo o volcado interno.
**** bitacora de un sabado
hoy estoy aca con derecho y no puedo escapar a las generales de la
ley.
O sea o bien te sentis culpable o bien tenes que ser utilitario. Es
decir que como permiso para estar aca tenes que aprovechar a hacer
cosas utiles, si es posible mejor pedi permiso a ella, o autorizacion,
y luego da la rendicion de cuenta de lo que hiciste. El sabado pasado
tuve la limpieza de la oficina, que era un issue muy necesario para mi
en ese momento (e increiblemente ayer con la ayudita de la romi que
fue muy valiosa no lo digo ironicamente pq si ella no iba a comprar el
balde yo no iba, y quizas no sacaba agua tampoco), y al final termine
limpiando a fondo casi como el otro dia, solo que me resulto mas
facil, pq no estaba sucio. Para hoy tenia el ir a comprar la
camicleta. Y posiblemente otras cosas, pero no tengo ganas de salir,
pq estoy un poco mareado y pq en realidad no tengo ganas, si casi que
tampoco tengo ganas de salir a comprar nada para comer, y no se que me
hare para comer.
Lo de la camicleta creo que no es justo el momento pq el lolo tuvo el
accidente y no vamos a ir con ese regalo para el euge sin algo para
el, y ambos potencialmente peligrosos.

Tengo que ver el tema de la comida, o sea que puedo hacer para ampliar
la base de cosas que pueda comer. Va mas alla de no tener ganas de ir
a comprar, sino que no tengo mas variantes.
Pq p.e. me guio con nutricion energetica y voy a los cereales y las
verduras pero no hago nada tampoco, termino con un arroz yamani, que
le agregue ayer una lata de lentejas que se me termino ahi nomas y
tomate. Tenemos que incorporar un par de opciones basicas que sean
alternativas. 
O sea ahi tendriamos menu 1 yamani, lentejas, tomate. Ok ahi lo vamos
a organizar. Incluso lo vamos a articular con org. Abajo en Menues los
menues concretos que se pueden hacer, y habria que hacer un registro
diario o algo asi para ver maso lo que como, no para siempre sino para
ver.
Cuando me ataque el miedo a no parecerme a ese matematico que lei en
mi niñez, creo que Roemers que registraba todo aspecto de su vida y
eso me parecio agobiante, y cada vez que intento llevar un registro de
algo me acuerdo de eso, recordarme que no es para siempre, y que los
periodos registrados son utiles para analizar y tomar decisiones.
**** muy bueno el sesamo
CLOCK: [2016-10-29 sáb 14:25]--[2016-10-29 sáb 14:33] =>  0:08
lo habia comprado hacia mucho y no lo prepare. Es muy facil tostarlo y
luego molerlo como hago con el lino y lo envase y puse en la
heladera. Cuando lo pones sobre el arroz o el tomate larga un aroma
exquisito y tiene un sabor muy bueno tambien. Aparte las cualidades
alimenticias a mejor disponibilidad que el tahin que es un producto
caro y preparado no se sabe como.
**** perdido por perdido
creo que debo actuar asi, perdido por perdido. Como Darin y la
Papaleo. o sea el tema bora, ir a hacer la transferencia y si rebota y
se enquilomba ahi nomas ir a sucesion. Y el tema embargo, creo que hay
que dejarlos venir y ahi ver, si conviene pagar o dejar que se lleven
lo que se quieran llevar, si es que vienen, por ahi, no se van a meter
en el chiquitaje de embargar muebles viejos si ellos estan para inhibir.
**** muy disconforme con la programacion
CLOCK: [2016-10-29 sáb 22:55]--[2016-10-29 sáb 23:04] =>  0:09
no se si es producto del clock o si es por la verga de damocles
isabelina de este sabado en dpto, o si es el pain del ojo que me
empieza a molestar. 
Pero me jode que llevo 7.15hs trabajando en el tab pedidos y no tengo
nada muy espectacular y tanto el resultado como el programa en si es
muy mediocre. En si no avanzo nada con relacion al mismo tipo de
programa en tcl pq para hacer alguna funcionalidad que realmente
marque la diferecia tendria que pensarla mucho y trabajarla mucho.
Porque aca la bocha seria:
1. que ergonomicamente el resultado sea mejor, que haya ganancia en
   rapidez en los procesos
2. que haya mas riqueza de datos recolectados y usados o factibles de
   ser usados.
3. que de ultima se pueda pulir la interface para que sea uniforme y linda
4. que el programa en si sea claro, que no sea enredado, que no tenga
   errores, que no sea dificil de mantener
Aca la duda proviene o bien lo programado es muy muy bueno y me cuesta
superarlo, o bien pierdo mucho tiempo en emacs/org/etc/
O bien el clock marca la gran puta diferencia y fue monumental la
cantidad de horas invertida en cada modulo, y ahora visto asi en
blanco y negro la cantidad de horas destinada me asombro.
Pero bueno. Habra que seguir.Paciencia. 
Estoy en el medio del baile, no me queda otra. Al menos tendre que
traducir y tener todo en la misma interfase.

Lo otro es un tema personal, la bronca que me da con el tema
isabelino.
Pero eso pasaria igual con o sin programacion.
*** [2016-10-30 dom]
CLOCK: [2016-10-31 lun 09:07]--[2016-10-31 lun 09:26] =>  0:19
Este fue el peor domingo que recuerde, y anoche la peor noche. Siento
como un rechazo generalizado a todo, como de un lugar que me es
contrario o adverso. Desde la beligerancia encubierta de ih, hasta la
falta de respeto directa de las chicas, la comida, el desorden, todo.
Ahora me planteo el por que me impongo semana tras semana esa
tortura. Es como que me borraran la mente o la memoria semana tras
semana y llegado el viernes estoy listo para ir corriendo a
encanutarme alla.
Yendo a lo practico, creo que la clave esta en el auto. Con el auto
aca puedo ir un domingo "de visita" dejarlo afuera y volverme al
rato. Pero mientras me plantee esta forma de pernoctancia, me resulta
en la practica mas dificil salirme de alla.
Cuando miro desde el punto del hartazgo del lunes, de la resaca del
lunes me pregunto como puede ser que el sabado haya estado siquiera
contaminado con ambas manifestaciones de la manipulacion o la
culpabilidad, el utilitarismo y la incomodidad del apuntamiento. 
Hay que decir tambien que muchos asuntos de negocios se mezclan con el
finde, por eso quiero resolverlo de otra manera.
Y por ultimo que hay rezagos de sentimentalismo luego del corte, pero
que no revisten el menor analisis.
*** [2016-10-31 lun]
CLOCK: [2016-10-31 lun 12:56]--[2016-10-31 lun 13:05] =>  0:09
Hoy atravese muchas etapas negativas. Autodestruccion, nerviosismo,
incomodidad, suicidio, locura, espanto. Cuando iba a la mañana a la
ofi pensaba que si me diagnosticaban algo feo o estigmatizante, me iba
a bolivia o brasil y me perdia en la selva, quemaba los documentos y
me pegaba un tiro.
Confome fue avanzando la mañana fui despejando el camino del modulo
tal cual lo imagine anoche cuando estaba acostado, y no sin esfuerzo
salio bien, a pesar de que esforce la espalda un monton.
Y estoy aislado.
el programa mejoro pq es mas legible y va perfilando a tener
utilidades que tcl no tenga, sino para que programo. Eso tambien es un
karma.
**** Me distraje mucho en el camino
emacs y org-mode entre otras cosas me distrajeron mucho del camino que
tendria que haber seguido que es haber definido bien los modulos que
necesitaba en funcion de dos cosas:
- las reglas de negocio que habia que poner
- la informacion que necesitabamos
Y al final me fui por la cordillera del himalaya y termine frustrado,
pq ahora uso emacs que en cualquier momento me desencanta y
cagamos. Es tan loco todo que en el fondo me llama la campanita de
atom.
Pero no. pq emacs lo tiene a org-mode, y eso es bueno para toda la
organizacion de mi vida en general.
**** Malestar emocional
[2016-10-31 lun]
Hoy es un dia en el cual no estoy bien. Estoy muy caido y me siento
bastante mal. Me parece o me cuesta el malestar que acarreo, agregando
capas de pelea o alejamiento. A la de la casa ih-chicas, tengo tambien
la sensacion en la galeria que todo esta mal, con el problema de la
puerta y en cierta forma en el edificio tambien no me siento muy
comodo. Debo ser yo. Y cuando transito el centro me siento muy
marginal. Se que es una percepcion pq no siempre estoy asi. Y quizas
se me pase.
*** [2016-11-01 mar]
CLOCK: [2016-11-01 mar 20:02]--[2016-11-01 mar 20:22] =>  0:20
Hoy nuevamente vi que algo que te preocupa mucho luego cuando lo haces
no es nada. Pero esta vez lo maneje bien. Era acompañarlo al Fede a
Colonia Caroya. Primero pense safar, pero luego pense que el
necesitaba mi apoyo y me habia pedido que vaya con el. Y creo que fue
importante que fuera. Tambien fue importante que todo lo decidiera por
fuera del canal isabelino.
Hoy tambien fui a la ecografia, aunque eso no me causo desasosiego,
pero si molestias, hasta el punto que estuve a un minuto de abandonar,
pq me meaba. Pero el analisis fue a fondo, y el lunes de nuevo Caeiro.
Hoy y antes he pensado cuando preparo las bolsas de cortinas que eso
me gusta, o sea me gusta el monoarticulo, me gusta esa venta hecha
bien en un sistema monoarticulo bien dimensionado, y en especial de
cortinas.
Lo cual esta muy bueno, pq puede ser que termine haciendo al final
algo que realmente me guste, sin importar la ganancia.
Como pensaba hoy mismo con relacion a la Elva, o sea lo que podria ser
una vision un poco idilica de las cosas, o sea siempre hay espinas,
pero al menos si te gusta algo es mejor.
Y de esa forma que yo imagine en ese momento para ella, vi despues que
lo de las bolsitas me gustaba para mi. Aparte de la programacion
obvio.
Y el entender la naturaleza humana y obrar en consecuencia, y no
renegar pq yo no la entienda o sea tozudo.
** [2016-11-02 mié]
CLOCK: [2016-11-02 mié 21:49]--[2016-11-02 mié 21:58] =>  0:09
Hoy un dia de mucho estres. Quizas mas que ayer. Fuimos a retirar la
kangoo. y mas que la llegada a autocity fue la contratacion del seguro
a traves del telefono lo que causo mas tension, y luego la venida con
el auto nuevo. Pero dentro de todo se desenvolvio bastante bien el
hijo. Creo que le va a tomar la mano bastante rapido.
Al menos dimos un paso importante en el negocio. Tanto como cuando
abrimos de nuevo el local y pasamos de estar varados en patricios a
tener una captacion, y luego cuando pasamos a tener una cobranza
unificada. Y ahora pasar de andar en la calle con una mierdita de
baulcito a tener una kangoo express es un salto cualitativo.
Igualmente creo que el local va a dar un acomodamiento que ahora no
hay pq esta todo despelotado y de esa forma sacaremos adelante toda
esa cuestion del desorden, del stock sin contar, etc. 
*** Hoy dia historico traje el bora
lo cual cierra un ciclo creo. Y aunque eleva el gasto aca me permite
mayor comodidad tanto de ir como de volver, y no me deja la obligacion
de quedarme a pernoctar alla que era el problema que se habia
planteado en forma tacita desde que vivo aca.
* Constructos
** Be normal
** mind sweep
   
* Temas a pensar y/o articular
** Seguridad en dpto

*** Cuanto tiempo vale la pena guardar los recibos?
    Siendo que no estamos en bco y son un medio de prueba en cierta
    forma de un ingreso percibido, todo al vicio pq no hay ninguna
    utilidad en tenerlos, aparte del lugar que ocupan y luego viene lo
    dificultoso que es ponerse a romper una tonelada.

* Diario de limpieza dpto
** Registro de temporada
*** [2016-10-29 sáb] guarde acolchado
** Baño
*** [2016-10-29 sáb]
** Dormitorio
*** [2016-10-29 sáb]
c/cambio sabanas y rotacion colchon
* Emacs
** Necesarios
*** atajo insertar dia con hora
*** eliminar lo molesto que el autofill te mueva la ventana y muestre flechas
** [[file:edu-emacs.org][emacs teoria]]

* Diario de migrañas
** Diario de migrañas fuertes
*** [2016-10-09 dom]                                            :3M:fuerte:
Me tomo el primer migral a las 9hs luego de una noche con molestias y
espera a la mañana para tomar el migral.
No considero que haya sido tardio en ese momento pq no me molesto ni
subio en intensidad. Hice un poco de netbook en cama y luego me
levante y trabaje en la terraza (con viento y sol), luego cuando
llegaba la hora de la comida me puse a trabajar en el patio con la
netbook a contrareloj muy presionado por terminar una secuencia antes
que me llamaran a comer, entonces me sente a comer tensionado y con el
clima beligerante de estos dias con las chicas. En ese momento pense
que necesitaba otro migral, pero no quise arruinar el gusto de la
comida, pero no comi tan feliz como en otras ocasiones.
Justo al terminar el almuerzo me tome otro migral y me quede en el
patio en un sitio mas o menos tranquilo tomando un te y el dolor
subia. Pero no era incapacitante todavia.
Me acuesto un rato y luego decido levantarme a tomar un cafe que tome
con mucha torta y mucho dulce de leche. Y luego de una breve pausa
para dormir que no debo haber dormido mas de diez minutos, bajo a
hacerme un segundo cafe, mientras tanto sigo con la maquina y algunas
frustraciones al medio.
Dentro de esas frustraciones me planteaba el no dispersarme tanto y
focalizarme en solo dos temas.
El dolor subio y se mezclo con un bajon animico pronunciado y un
malestar generalizado.
Alli cuando me acuesto tipo 20.30 y empieza una migraña tipo 8 o 7,
incapacitante hasta para pensar (pero mas por el malestar que por el
dolor punzante). Cuando me lograba dormir me mejoraba un poco, a las
21.30 ih me subio pure de calabazas que pude probar apenas pq estaba
nauseoso. Tome reliveran a las 22.30 y en esas levantadas al baño el
dolor por el movimiento era muy importante, igual que la fotofobia.
Cuando hizo efecto el reliveran me tomo el tercer migral y en los
proximos 45 minutos no experimente ninguna mejoria, acostado sobre el
costado derecho me presionaba mucho la zona del higado, y sobre el
costado izquierdo me presionaba la cabeza donde me dolia.
Quizas una hora despues o dos, ya me mejore quedando solo la resaca
que desaparecio durante la noche.
*** [2016-10-15 sáb]                                        :3M:intermedio:
Hoy desperte a las 4am con fuerte dolor, el clasico y claro dolor
despertador que amerita un migral, tomo y me duermo, siendo
efectivo. Me levanto bien, hago las tareas que habia pensado para el
dia en forma bastante satisfactoria, salvo por dolor intenso en la
espalda pq habia limpiado la oficina. Luego de comer bien (bifes con
cebolla rucula papas), me meto en la compu para instalar un nuevo SO y
el dolor va increscendo hasta hacerse un moderado que ameritaba otro
migral y a eso de las 15hs me lo tomo, se aminora bastante y me echo
una siestita que dormi con dificultad pero dormi, la dificultad fue
por la falta de oscuridad total y por no tener hecha la cama, ya que
necesito si o si ponerme los auriculares, debo haber dormido una hora
en la misma posicion y despierto con un fuerte dolor de nuevo y me
tomo el tercer migral del dia a las 17hs, sin nauseas hasta ahora, y
no espero resolucion ni nada sino que me enfrasco en la compu, y en un
momento de relax cuando miro por la ventana de la cocina, me golpeo
fuertemente la frente, hasta el punto del sangrado, asi que ahora no
se si tengo resaca o dolor del golpe. 
Si bien es cierto que no tuvo la magnitud del domingo pasado, si
podria haberlo ubicado en un comodo 6 en el momento de levantarme que
me impediria las actividades. Y alli decidi ir al medico mañana. En
realidad comenzar a ir a todos los medicos. O sea instalarme en el hp
del patio olmos. o el central si hace falta. 
*** [2016-10-18 mar]                                            :2M:fuerte:
El domingo tomo dos migrales seguidos, me cayo un poco mal la comida
(pollo al disco) y me percato que era tipo cefaleico y cedio bastante
rapido y me bañe y me sente en la terraza y mejore bastante. 
Ayer lunes en la oficina tome dos migrales con separacion de 2 horas
mas o menos y tambien un dolor cefaleico moderado a molesto pero cedio
practicamente cuando volvia a casa. Y hoy fue diferente, tomo los 2
migrales con diferencia de una hora, y recien despues de 5 horas de
haber tomado el ultimo puedo sentarme a escribir esto mas o menos en
la cama. Me volteo, altamente incapacitante creo que a nivel 7, un
poco menos que el domingo 9 pq casi no tuve nauseas. Solo un poco en
la hora de la toma de los migrales, y repeticiones de la comida a
pesar que fue yamani con rucula y quesito. Hace un rato me tome un te
con galletas queso y miel y me fui mejorando paulatinamente. Del
cefaleico parecido a los ultimos dos dias, se fue transformando en
levemente migraico y luego cediendo.
Creo que la causa real es que ya estoy en las ultimas del migral y los
dolores son mas fuertes y descontrolados.
*** [2016-10-26 mié]                                            :2M:fuerte:
Me desperte bien, dentro del malestar que vengo teniendo de tinitus
por asi decirlo, p.e. anoche no dormi con lluvia, y tuve sueños
confusos. Me despierto con el dolorcito insidioso de siempre y me tomo
un migral a las 7 am. Y el malestar no se va y se agrava. Decido tomar
otro migral a las 8am para terminar con el asunto y se me agrava mas,
y empiezo a devenir nauseoso.
14.5/10 la presion, sin hambre, mal, nauseas, casi diria mareos o
confusion. Tenia la presion ridicula de tener que ir a la dgr
(ridicula pq como dijo dyer al final termino siendo menor que lo que
yo imaginaba).
"La catastrofe que tanto te preocupa, a menudo resulta menos horrible
en la realidad, de lo que fue en tu imaginacion"
Cuando fui, pq baje para ir a comprar los remedios y termine yendo por
ratos o cuadras me sentia mejor, pero en realidad me senti mejor que
p.e. lo que estoy ahora a las 12.30 en casa.
Me tome 10mg de corti a las 11.30hs y hasta ahora estoy peor. Me tome
a la misma hora 35 gotas de reliveran y sigo nauseoso, y de pedo tome
un te con dos galletas y queso.



** Diario de dias 3 Migrales aunque no migrañas fuertes
*** [2016-10-13 jue]                                          :3M:moderado:
   Desperte a la 1 de la mañana y tome un migral con un trago de
   licuado. Y si bien es cierto que pude dormir lo mas bien, cada vez
   que me despertaba sentia molestia, y me decia que ojala la molestia
   no significara un segundo migral, y felizmente llegue a la
   mañana. Luego desayuno y voy a la ofi. Y alli tipo 11hs tomo un
   migral normal como hago siempre, y luego de nuevo en la ofi a la
   tarde siento que el dolor va in crescendo y tipo 16hs tomo otro
   sabiendo que tenia que quedarme hasta las 17 obligadamente. 
   Luego llego a casa en un estado raro, no queria sentarme a
   programar, me sentia saturado, y me hice una merienda frutal con
   manzana, arandanos y frutilla y medio vaso de licuado, previamente
   haberme bañado tranquila y relajadamente, todo esto mientras veia
   la mitad de la pelicula que habia dejado pendiente, y la verdad que
   me relaje bastante, luego me recoste un rato (en realidad el orden
   de estos sucesos ya los olvide pero el resultado grato lo recuerdo)
   la cosa que despues si me sente a programar y la verdad que fue
   altamente productivo el tiempo que estuve, en cierta forma como
   destrabado. Quizas sea que haya aprovechado una base que habia
   hecho en la oficina, pero si me senti como que "fluyo" el trabajo y
   me senti como que podia terminar alli mismo todo el modulo, pero me
   fui a dormir. Esta mañana crei tener un par de puntaditas de nuevo
   en el ojo, aunque no son en el ojo sino en el arco superciliar.

* Movies
** Films
*** The irrational man                       :profesor:filosofia:asesinato:
   [2016-10-13 jue] Cuenta la historia de un profesor de filosofia que
   viene a una facultad y el tipo esta atravesando un bajon
   existencial. La vida no le interesa y atraviesa un gran displacer,
   nada le resulta placentero. Es sombrio, oscuro y practicamente esta
   abandonado. Comienza una amistad con una alumna que intenta sin
   exito sacarlo de ese marasmo. Un dia casualmente escuchan una
   conversacion en un bar sobre un juez que estaba arruinandole la
   vida a una mujer por abuso de poder en su cargo, y repentinamente
   el profesor encuentra en el asesinar a dicho juez su razon de
   vivir. A partir de ese momento su vida renace en todos los sentidos
   que antes estaban bloqueados. Comete el asesinato, pensando que no
   iba a ser descubierto, y al poco tiempo la misma alumna con quien
   ya ha comenzado un affaire lo descubre y confronta. La situacion se
   complica cuando la chica lo obliga a confesar el crimen pq alguien
   inocente va a ser inculpado y el ya no quiere abandonar los
   placeres de esta nueva vida que acaba de conseguir y decide matar a
   la chica para cubrir su crimen, intento que casualmente le falla y
   muere accidentalmente el mismo.
   :Calificacion: 4/5
   :Actor: Joaquin Phoenix

** Series
*** The Night of                        :prision:inocente:juicio:granintro:
   [2016-10-17 lun] Terminada.
   8 capitulos.
   Narra la historia de un chico pakistani en NY que le saca sin
   permiso el taxi a su padre (que a su vez lo tiene en sociedad con
   dos mas y que representa su unica fuente de ingresos que les
   permite tener una vida de clase media a pesar de ser inmigrantes)
   con la finalidad de ir a una fiesta y la cadena de sucesos lo lleva
   a conocer una chica rica drogadicta y con problemas que lo lleva a
   la casa donde tienen sexo y juegos peligrosos, luego despierta
   abajo en la cocina sin saber que paso anoche y cuando sube a la
   habitacion la chica esta muerta con un monton de puñaladas. Entra
   en panico y escapa, pero olvida las llaves del auto, cuando quiere
   entrar de nuevo a la casa tiene que romper un vidrio y eso alerta a
   los vecinos, saca las llaves, se lleva el cuchillo ensangrentado y
   sale a los piques con el taxi, y luego casualmente por doblar mal
   una esquina lo para la policia y lo detienen por ebriedad. Y cae a
   la misma comisaria donde se procesa el asesinato, donde al final lo
   detienen.
***** La vida y el trabajo del abogado
el abogado tiene una vida de mierda. Esta solo, separado y viejo,
encima la relacion con el hijo no es buena ni es mala pero no es
fluida. Y lo peor de todo que tiene una enfermedad estigmatizante que
hace que los demas lo vean repugnante. 
***** La vida y la historia previa de la chica
una chica rica, heredera, drogadicta, con problemas con una pareja que
la estafo. 
***** La vida y el entorno del chico
una familia muy tradicional, inmigrantes sufrientes por lo del 9/11 y
ser arabes, clase media, buen pasar
***** Como reacciona la familia
el padre cree siempre en el chico, a pesar de que lo que hizo resulta
catastrofico para la economia de la familia pq pierde el taxi que es
su negocio, no se lo ve resentido, y la madre pierde la fe en el chico
cuando en el juicio ve lo que supuestamente ha hecho
***** La actuacion de la abogada
primero la usan por su nacionalidad como palanca luego le tiran el
caso para el cual no esta preparada, y luego comete unos errores
garrafales que pueden costarle la carrera, parece que se enamora del
chico y luego comete directamente el delito de pasarle droga. No se ve
que luego el chico le corresponda
***** el chico sobrevivio
se adapto a la vida de la prision, en todo momento parecia tener un
amor fati. 
***** Conclusion
muy buena serie, la volveria a ver, la introduccion genial
*** WestWorld                                              :west:androides:
Episodio 1 [2016-10-24 lun]
Cuenta un parque de diversiones enorme que recrea el viejo oeste y
todo atendido por androides casi humanos, los cuales poseen IA, pero
tienen limitaciones en el programa, p.e. que no pueden dañar a los
humanos y olvidan cada temporada lo que paso antes.
Y asi parece que han hecho negocios por mas de treinta años.
Hasta que en una actualizacion del firmware de los androides que les
permite tener gestos mas realistas, comienzan a tener sintomas raros
que aparentemente provienen de que se le mezclan los recuerdos (que
serian memorias en este caso) pero produciendo efectos espeluznantes
en aquellos que olvidan que son maquinas programadas.
**** Arnold y su busqueda de conciencia
la consciencia evoluciono en base a errores.
**** [2016-10-29 sáb] Las historias o relatos que cargan en los huespedes
se parecen mucho a las boludeces que nos motivan y nos ocupan o nos
alienan a nosotros. Lo facsinante de la serie es el parecido con los
seres humanos, o sea como que nosotros somos ellos y hubiera una
instancia superior desconocida para nosotros que nos maneja de igual
forma. Hay muchas cosas inexplicables en los seres humanos. Obviamente
la serie se inventa sobre la base de la experiencia humana, eso no es
real, pero porque no, que es la realidad, asi como un programa es real
dentro de sus propias reglas de juego, nosotros podemos ser una pieza
de un juego cosmico de proporciones desmesuradas que no conocemos.
* Alimentaria
** Menues
*** Yamani-Lenteja-Tomate
*** Mijo-Amaranto-Calabacin
** Incorporados
*** Lino 
*** Sesamo
comprar bolsa 100 gramos organico
tostar
moler
** tema alimentario (luego trasladar a otro sitio)
*** opciones de comidas para considerar
**** Guiso cereal y verduras
    puse una rodaja de calabaza, un poco de sal, un poco de mijo
    lavado y un poco de amaranto y lo hervi. Feo olor, como comida de
    perro pero se deja comer bastante, con oliva y un poquito de queso
    rico
**** Usar la legumbre en latas
    antes que nada es mejor  y permite combinar el cereal.
**** Un tomatito, lentejas, ajito y una ensaladita que acompaña
* Diario de Sintomas
** insomnio de piernas inquietas y/o presion intercostal
*** [2016-10-30 dom]
que se manifiesta pq te das vuelta ocho mil veces, y las piernas no
duelen pero estan como anudadas, y molestan. Y no podes estar de
costado pq te duelen las costillas como que algo te presionara adentro
y eso te obliga a darte vuelta cada dos minutos, y solo quizas
acostarte boca arriba pero asi uno normalmente no duerme.
** mareos generales o sensacion de mareos
*** [2016-10-30 dom]--[2016-10-31 lun]
en especial luego e inmediatamente despues de la toma del migral. El
domingo tomo un migral a la mañana con un malestar un poco menor, pero
cuando lo tomo a la nochecita el malestar fue tan grande e inmediato
que pense que me iba a desmayar. Incluso le dije a ih que no se
asustara si me desmayaba y pense que no llegaba a la pieza
arriba. Luego me acoste y se me fue el mareo, o no lo percibi como
vertigo y comenzo el sintoma del insomnio. Y esta mañana, me levante
como si no hubiera dormido nada anoche, como si me hubiera aplastado
algo, como si los musculos de los brazos tuvieran cansados luego de un
dia de mucha fuerza o ejercicios. Y siento un sintoma de mareito.
** Puntaditas en los arcos supercilliarres
*** [2016-10-31 lun]
no muy pronunciadamente como en descripciones anteriores pero he
tenido molestias durante el dia, en especial en la oficina, mayormente
en el lado izquierdo, pero me parece que tambien pasa al otro lado
** Dolor o molestia en sona de vejiga
*** [2016-10-31 lun]
no lo habia anotado nunca y no se si es sogaca por lo de la ecografia,
pero en cierta forma tengo un dolorcillo hace tiempo en el area,
pareciera superficial, mas tipo hernioso.



